<template>
  <Layout :header="true" :footer="true" class="page page-knowledge-base">
    <section class="hero blue">
      <b-container>
        <b-row class="align-items-center justify-content-center">
          <b-col lg="9" class="text-lg-center">
            <h1>
              Разгрузите техподдержку: создайте базу знаний для вашего сайта
            </h1>
            <p class="py-3">
              База знаний, в которой пользователи могут самостоятельно найти
              ответы на свои вопросы, и не нагружают поддержку
            </p>
            <b-button href="/panel/toAPP/knowledge-base/" variant="primary"
              >Создать базу знаний</b-button
            >

            <g-image
              src="@/assets/images/knowledge-base/left-book.svg"
              quality="100"
              class="hero__book hero__book-left d-none d-lg-block"
              alt="Левая книга"
            />
            <g-image
              src="@/assets/images/knowledge-base/right-book.svg"
              quality="100"
              class="hero__book hero__book-right d-none d-lg-block"
              alt="Правая книга"
            />
          </b-col>
          <g-image
            src="@/assets/images/knowledge-base/hero.png"
            width="800"
            height="606"
            quality="100"
            class="hero__pic mw-100 d-none d-lg-block"
            alt="Разгрузите техподдержку: создайте базу знаний для вашего сайта"
          />
        </b-row>
      </b-container>
    </section>

    <!-- 24/7 -->
    <section class="resource">
      <b-container>
        <b-row>
          <b-col lg="6" class="order-lg-2 mb-5 text">
            <h2 class="mb-4">
              Источник знаний для вашего пользователя 24/7, даже когда поддержка
              спит
            </h2>
            <ul class="mb-5">
              <li>
                Пользователь может найти ответ сам и снизит нагрузку
                на операторов
              </li>
              <li>
                Статьи в базе знаний разделены на категории для быстрого поиска
              </li>
              <li>Поиск по ключевым словам поможет найти ответ</li>
              <li>
                Верстка статей адаптирована под компьютеры, планшеты и мобильные
              </li>
              <li>Ссылка на базу знаний есть в чате</li>
            </ul>
            <b-button href="/panel/toAPP/knowledge-base/" variant="primary"
              >Создать базу знаний</b-button
            >
          </b-col>
          <b-col lg="6">
            <g-image
              src="@/assets/images/knowledge-base/resource.png"
              quality="100"
              class="mw-100"
              alt="Скачивайте мобильное приложение для операторов"
              title="Mobile Apps"
            />
          </b-col>
        </b-row>
      </b-container>
    </section>

    <!-- База знаний с вашим дизайном -->
    <section class="save">
      <b-container>
        <b-row>
          <b-col class="text-md-center mb-4 mb-lg-5">
            <div class="save__icon d-none d-md-block">
              <svg
                width="80"
                height="76"
                viewBox="0 0 80 76"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M2.06356 11.4286L13.0086 32.7709L26.8689 1.02534L29.2167 36.5797L64.0503 11.4919L43.9865 47.9714L74.0262 48.0021L45.4 64.5638L63.9863 74.0633"
                  stroke="#FF8246"
                  stroke-width="3"
                ></path>
              </svg>
            </div>
            <h2>
              База знаний <br />
              с вашим дизайном
            </h2>
          </b-col>
        </b-row>
        <b-row>
          <b-col md="6" xl="4" offset-xl="2" class="mb-3 mb-md-5">
            <b-row class="align-items-center">
              <b-col cols="3" md="4">
                <svg
                  width="97"
                  height="81"
                  viewBox="0 0 97 81"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  class="mw-100"
                >
                  <rect
                    x="95.5"
                    y="1.5"
                    width="78"
                    height="94"
                    rx="12.5"
                    transform="rotate(90 95.5 1.5)"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <path
                    d="M30.3505 49.7788L32.1824 41H36L32.6103 55H28.6172L26.4781 47.0192L24.3828 55H20.4007L17 41H20.8285L22.6605 49.7788L24.8545 41H28.1236L30.3505 49.7788Z"
                    fill="#3B3D3E"
                  />
                  <path
                    d="M52.3505 49.7788L54.1824 41H58L54.6103 55H50.6172L48.4781 47.0192L46.3828 55H42.4007L39 41H42.8285L44.6605 49.7788L46.8545 41H50.1236L52.3505 49.7788Z"
                    fill="#3B3D3E"
                  />
                  <path
                    d="M74.0531 49.7788L75.9815 41H80L76.4319 55H72.2286L69.9769 47.0192L67.7714 55H63.5797L60 41H64.03L65.9584 49.7788L68.2679 41H71.709L74.0531 49.7788Z"
                    fill="#3B3D3E"
                  />
                  <path
                    d="M83 -7.00792e-07C90.732 -3.13755e-07 97 6.26802 97 14L97 21L-8.01581e-07 21L-5.34387e-07 14C-2.39253e-07 6.26801 6.26801 -4.54173e-06 14 -4.15469e-06L83 -7.00792e-07Z"
                    fill="#FF8246"
                  />
                  <circle cx="65.001" cy="11" r="3" fill="white" />
                  <circle cx="74.001" cy="11" r="3" fill="white" />
                  <circle cx="83.001" cy="11" r="3" fill="white" />
                </svg>
              </b-col>
              <b-col>
                <p class="mb-0">Подключите собственный домен</p>
              </b-col>
            </b-row>
          </b-col>
          <b-col md="6" xl="4" class="mb-3 mb-md-5">
            <b-row class="align-items-center">
              <b-col cols="3" md="4">
                <svg
                  width="103"
                  height="82"
                  viewBox="0 0 103 82"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  class="mw-100"
                >
                  <rect
                    width="69"
                    height="81"
                    rx="14"
                    transform="matrix(-1 0 0 1 69 1)"
                    fill="url(#paint0_linear)"
                  />
                  <path
                    d="M50.5413 55.1969L51.602 56.2575L50.5413 55.1969C49.7854 55.9528 48.56 55.9528 47.8041 55.1969C47.0481 54.4409 47.0481 53.2156 47.8041 52.4596L48.5161 51.7476C50.326 49.9377 50.6233 47.3465 50.6594 45.3733C50.6906 43.662 51.358 41.9648 52.6627 40.6602L70.7088 22.614C73.3813 19.9415 77.7144 19.9415 80.3869 22.614C83.0594 25.2865 83.0594 29.6196 80.3869 32.2921L62.3408 50.3383C61.0361 51.6429 59.3389 52.3103 57.6276 52.3416C55.6545 52.3776 53.0633 52.6749 51.2533 54.4849L50.5413 55.1969Z"
                    fill="white"
                    stroke="#FF8246"
                    stroke-width="3"
                  />
                  <path
                    d="M52 70C52 72.2091 50.2091 74 48 74C45.7909 74 44 72.2091 44 70C44 67.7909 45.7909 62 48 62C50.2091 62 52 67.7909 52 70Z"
                    fill="white"
                  />
                  <rect
                    x="87.5"
                    y="2.62156"
                    width="17.665"
                    height="26.4667"
                    rx="8.5"
                    transform="rotate(45 87.5 2.62156)"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <rect
                    x="63.1213"
                    y="18.4553"
                    width="8.63567"
                    height="30.6192"
                    rx="4.31783"
                    transform="rotate(-45 63.1213 18.4553)"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <defs>
                    <linearGradient
                      id="paint0_linear"
                      x1="70.2162"
                      y1="-6.74999"
                      x2="-32.0081"
                      y2="81.8492"
                      gradientUnits="userSpaceOnUse"
                    >
                      <stop offset="0.248968" stop-color="#FF8246" />
                      <stop offset="1" stop-color="#3B3D3E" />
                    </linearGradient>
                  </defs>
                </svg>
              </b-col>
              <b-col>
                <p class="mb-0">Подберите свой цвет</p>
              </b-col>
            </b-row>
          </b-col>
          <b-col md="6" xl="4" offset-xl="2" class="mb-3 mb-lg-0">
            <b-row class="align-items-center">
              <b-col cols="3" md="4">
                <svg
                  width="97"
                  height="82"
                  viewBox="0 0 97 82"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  class="mw-100"
                >
                  <rect
                    x="77.8203"
                    y="19.2466"
                    width="60.4004"
                    height="76.0702"
                    rx="12.25"
                    transform="rotate(90 77.8203 19.2466)"
                    stroke="#3B3D3E"
                    stroke-width="3.5"
                    stroke-dasharray="12 12"
                  />
                  <rect
                    x="95.5"
                    y="1.5"
                    width="60.9004"
                    height="76.5702"
                    rx="12.5"
                    transform="rotate(90 95.5 1.5)"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <path
                    d="M25.9278 38.987L41.3818 24.9546C43.4079 23.1148 46.546 23.1266 48.5577 24.9815L61.3528 36.7794C63.1678 38.4529 65.9365 38.6469 67.9769 37.2432L74.3039 32.891C76.1164 31.6441 78.5344 31.6441 80.3469 32.891L87.95 38.1211C89.3478 39.0827 90.1796 40.6491 90.1796 42.3202V51.9199C90.1796 54.7555 87.8287 57.0541 84.9286 57.0541H29.501C26.601 57.0541 24.25 54.7555 24.25 51.9199V42.7492C24.25 41.3216 24.8579 39.9586 25.9278 38.987Z"
                    fill="#FF8246"
                  />
                  <ellipse
                    cx="66.3086"
                    cy="17.116"
                    rx="7.19921"
                    ry="7.22683"
                    fill="#FF8246"
                  />
                </svg>
              </b-col>
              <b-col>
                <p class="mb-0">Установите свой логотип</p>
              </b-col>
            </b-row>
          </b-col>
          <b-col md="6" xl="4">
            <b-row class="align-items-center">
              <b-col cols="3" md="4">
                <svg
                  width="90"
                  height="80"
                  viewBox="0 0 90 80"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  class="mw-100"
                >
                  <rect
                    width="89.5896"
                    height="49.6638"
                    rx="24.8319"
                    fill="#FF8246"
                  />
                  <path
                    d="M45.3213 24.832C45.3213 14.0974 54.0234 5.39526 64.758 5.39526C75.4926 5.39526 84.1947 14.0974 84.1947 24.832C84.1947 35.5666 75.4926 44.2687 64.758 44.2687C54.0234 44.2687 45.3213 35.5666 45.3213 24.832Z"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <path
                    d="M60.9502 39.0908C60.9461 36.5385 58.007 35.0912 55.9617 36.6343L31.2296 55.2931C29.3909 56.6803 29.6607 59.5049 31.729 60.5235L40.3002 64.744L34.6271 75.0264C34.2021 75.7967 34.5079 76.7638 35.3 77.1538L40.7531 79.839C41.5451 80.229 42.5045 79.885 42.8636 79.0822L47.6565 68.3664L56.511 72.7264C58.5794 73.7449 61.0037 72.2468 61 69.9525L60.9502 39.0908Z"
                    fill="#3B3D3E"
                  />
                </svg>
              </b-col>
              <b-col>
                <p class="mb-0">Отключите лейбл «Работает на Carrot quest»</p>
              </b-col>
            </b-row>
          </b-col>
        </b-row>
      </b-container>
    </section>

    <!-- Операторы не тратят время на частые вопросы -->
    <section class="features">
      <b-container>
        <b-row>
          <b-col lg="4">
            <h2 class="mb-4">Операторы не тратят время на частые вопросы</h2>
            <p class="mb-5">
              Оператор найдёт и отправит ссылку на статью из базы знаний за пару
              кликов, чтобы пользователь быстрее решил свою проблему
            </p>
          </b-col>
          <b-col lg="8">
            <video
              autoplay
              loop
              muted
              playsinline
              class="embed-responsive-item mw-100"
            >
              <source
                src="https://www.carrotquest.io/assets/video/components/9.webm"
                type="video/webm"
              />
              <source
                src="https://www.carrotquest.io/assets/video/components/9.mp4"
                type="video/mp4"
              />
            </video>
          </b-col>
        </b-row>
      </b-container>
    </section>

    <!-- Мобильное приложение -->
    <section class="mobile-app">
      <b-container>
        <b-row>
          <b-col lg="6" class="order-lg-2 mb-5 text">
            <h2 class="mb-4">
              Статьи из базы знаний в чат можно отправлять в мобильном
              приложении оператора
            </h2>
            <ul class="mb-5">
              <li>
                Операторы могут общаться с пользователями и отправлять статьи
                из базы знаний прямо из мобильного приложения
              </li>
              <li>
                Пользователь быстро получит подробный и эталонный ответ на свой
                вопрос из базы знаний, независимо от загруженности поддержки
              </li>
            </ul>
            <p>Скачивайте мобильное приложение для операторов:</p>
            <a
              href="https://apps.apple.com/us/app/carrot-quest/id1259157795"
              target="_blank"
              rel="noopener"
              class="AppStore mr-4"
            >
              <img
                src="@/assets/images/components/AppStore-button.png"
                alt="AppStore"
              />
            </a>
            <a
              href="https://play.google.com/store/apps/details?id=carrotquest.mobil.inkov.carrotquest"
              target="_blank"
              rel="noopener"
              class="GooglePlay"
            >
              <img
                src="@/assets/images/components/GooglePlay-button.png"
                alt="GooglePlay"
              />
            </a>
          </b-col>
          <b-col lg="6">
            <g-image
              src="@/assets/images/components/33.png"
              quality="100"
              class="mw-100"
              alt="Скачивайте мобильное приложение для операторов"
              title="Mobile Apps"
            />
          </b-col>
        </b-row>
      </b-container>
    </section>

    <!-- Удобно добавлять и редактировать статьи -->
    <section class="resource">
      <b-container>
        <b-row>
          <b-col lg="5" class="mb-5 text">
            <h2 class="mb-4">Удобно добавлять и редактировать статьи</h2>
            <ul class="mb-5">
              <li>
                Каждый член вашей команды может создать статью в простом
                визуальном редакторе
              </li>
              <li>
                Делайте статьи наглядными: вставляйте код, таблицы, картинки
                и видео
              </li>
              <li>Количество статей в базе знаний не ограничено</li>
              <li>Сохраняйте черновики, если статья еще не готова</li>
            </ul>
            <b-button href="/panel/toAPP/knowledge-base/" variant="primary"
              >Создать базу знаний</b-button
            >
          </b-col>
          <b-col lg="7">
            <video
              autoplay
              loop
              muted
              playsinline
              class="embed-responsive-item mw-100"
            >
              <source
                src="https://www.carrotquest.io/assets/video/components/12.webm"
                type="video/webm"
              />
              <source
                src="https://www.carrotquest.io/assets/video/components/12.mp4"
                type="video/mp4"
              />
            </video>
          </b-col>
        </b-row>
      </b-container>
    </section>

    <!-- Улучшайте качество базы знаний на основе данных -->
    <section class="analitics">
      <b-container>
        <b-row>
          <b-col lg="6" class="order-lg-2 mb-5 text">
            <h2 class="mb-4">
              Улучшайте качество базы знаний на основе данных
            </h2>
            <p>
              Анализируйте и улучшайте ваши статьи на основе информации
              о прочтениях, доскроллах, показателях отказов и других метрик.
            </p>
            <p>Подключите Яндекс.Метрику и Google Analytics</p>
          </b-col>
          <b-col lg="6">
            <g-image
              src="@/assets/images/knowledge-base/analitics.png"
              quality="100"
              class="mw-100"
              alt="Улучшайте качество базы знаний на основе данных"
            />
          </b-col>
        </b-row>
      </b-container>
    </section>

    <!-- Прокачивайте SEO: статьи индексируются в поисковых системах -->
    <section class="seo">
      <b-container>
        <b-row>
          <b-col lg="10" xl="8">
            <h2 class="mb-3 mb-lg-4">
              Прокачивайте SEO: статьи индексируются в поисковых системах
            </h2>
            <p class="mb-3">
              Статьи из базы знаний правильно отображаются в поисковиках
              и приводят трафик на сайт. Вы можете менять SEO-настройки
              и самостоятельно определить, какие статьи должны индексироваться.
            </p>
          </b-col>
        </b-row>
        <b-row>
          <b-col>
            <g-image
              src="@/assets/images/knowledge-base/articles.png"
              quality="100"
              class="mw-100"
              alt="Прокачивайте SEO: статьи индексируются в поисковых системах"
            />
          </b-col>
        </b-row>
      </b-container>
    </section>

    <!-- Это бесплатно для пользователей Carrot quest -->
    <section class="free">
      <b-container>
        <b-row>
          <b-col lg="10" xl="8">
            <h2 class="mb-3 mb-lg-4">
              Это бесплатно для пользователей Carrot quest
            </h2>
            <p class="mb-4 mb-lg-5">В бесплатную версию базы знаний входит:</p>
          </b-col>
        </b-row>
        <b-row>
          <b-col md="4" lg="3" class="text-lg-center mb-4">
            <div class="free__box blue h-100">
              <div class="free__box__pic mb-3">
                <svg
                  width="59"
                  height="72"
                  viewBox="0 0 59 72"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M49.5659 0H14.3186C12.6351 0 11.1621 1.47302 11.1621 3.36691V55.554C11.1621 57.4479 12.6351 58.9209 14.3186 58.9209H55.3528C57.1415 58.9209 58.5093 57.4479 58.5093 55.554V9.04857L49.5659 0Z"
                    fill="#FF8246"
                  />
                  <path
                    d="M3.15648 14.5234H37.7774L45.8472 22.6882V68.5775C45.8472 69.7398 45.0573 70.4444 44.1907 70.4444H3.15648C2.36359 70.4444 1.5 69.7065 1.5 68.5775V16.3903C1.5 15.2614 2.36359 14.5234 3.15648 14.5234Z"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <path
                    d="M35 13V20.65C35 23.05 36.95 25 39.2 25H47"
                    fill="#3B3D3E"
                  />
                  <path
                    d="M9.10547 31.2339H32.7791M9.10547 39.4286H25.4949"
                    stroke="#484848"
                    stroke-width="2.76003"
                  />
                </svg>
              </div>
              <p class="mb-0">До 30 статей постоянно и навсегда</p>
            </div>
          </b-col>
          <b-col md="4" lg="3" class="text-lg-center mb-4">
            <div class="free__box blue h-100">
              <div class="free__box__pic mb-3">
                <svg
                  width="60"
                  height="59"
                  viewBox="0 0 60 59"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M49.6904 51.0344C49.6904 51.5329 49.4225 52.1937 48.5266 52.9773C47.6339 53.7582 46.2555 54.5299 44.4226 55.208C40.7686 56.56 35.6205 57.4263 29.8608 57.4263C24.1012 57.4263 18.9531 56.56 15.2991 55.208C13.4662 54.5299 12.0878 53.7582 11.195 52.9773C10.2992 52.1937 10.0312 51.5329 10.0312 51.0344C10.0312 50.5359 10.2992 49.8752 11.195 49.0916C12.0878 48.3106 13.4662 47.539 15.2991 46.8608C18.9531 45.5089 24.1012 44.6426 29.8608 44.6426C35.6205 44.6426 40.7686 45.5089 44.4226 46.8608C46.2555 47.539 47.6339 48.3106 48.5266 49.0916C49.4225 49.8752 49.6904 50.5359 49.6904 51.0344Z"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <path
                    d="M8.53125 21.0449V24.2017V25.2539C8.53125 28.2002 10.8775 30.5152 13.8637 30.5152H14.9301C17.9163 30.5152 20.2625 32.8301 20.2625 35.7764V56.5"
                    stroke="#3B3D3E"
                    stroke-width="3"
                    stroke-miterlimit="10"
                  />
                  <path
                    d="M51.1912 21.0449V24.2017V25.2539C51.1912 28.2002 48.845 30.5152 45.8588 30.5152H44.7924C41.8062 30.5152 39.46 32.8301 39.46 35.7764V56.5"
                    stroke="#3B3D3E"
                    stroke-width="3"
                    stroke-miterlimit="10"
                  />
                  <path
                    d="M29.8613 21.0449V57"
                    stroke="#3B3D3E"
                    stroke-width="3"
                    stroke-miterlimit="10"
                  />
                  <path
                    d="M17.0636 5.26184V17.8891C17.0636 19.6779 15.6772 21.0459 13.8642 21.0459H3.19943C1.38642 21.0459 0 19.6779 0 17.8891V3.1573C0 1.36844 1.38642 0.000488281 3.19943 0.000488281H11.7312"
                    fill="#FF8246"
                  />
                  <path
                    d="M11.7314 0V2.10485C11.7314 3.89397 13.1179 5.26212 14.9308 5.26212H17.0638"
                    fill="#484848"
                  />
                  <path
                    d="M38.3917 5.26135V17.8886C38.3917 19.6775 37.0053 21.0454 35.1923 21.0454H24.5276C22.7145 21.0454 21.3281 19.6775 21.3281 17.8886V3.15681C21.3281 1.36795 22.7145 0 24.5276 0H33.0594"
                    fill="#FF8246"
                  />
                  <path
                    d="M33.0605 0V2.10485C33.0605 3.89397 34.447 5.26212 36.26 5.26212H38.3929"
                    fill="#484848"
                  />
                  <path
                    d="M59.4982 5.26135V17.8886C59.4982 19.6775 58.1118 21.0454 56.2988 21.0454H45.634C43.821 21.0454 42.4346 19.6775 42.4346 17.8886V3.15681C42.4346 1.36795 43.821 0 45.634 0H54.1658"
                    fill="#FF8246"
                  />
                  <path
                    d="M54.166 0V2.10485C54.166 3.89397 55.5524 5.26212 57.3654 5.26212H59.4984"
                    fill="#484848"
                  />
                </svg>
              </div>
              <p class="mb-0">
                Разделение <br />на категории и поиск <br />по базе знаний
              </p>
            </div>
          </b-col>
          <b-col md="4" lg="3" class="text-lg-center mb-4">
            <div class="free__box blue h-100">
              <div class="free__box__pic mb-3">
                <svg
                  width="75"
                  height="58"
                  viewBox="0 0 75 58"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <rect
                    x="73.2649"
                    y="1.15303"
                    width="54.7723"
                    height="72.1125"
                    rx="8.07123"
                    transform="rotate(90 73.2649 1.15303)"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="2.30606"
                  />
                  <path
                    d="M24.7553 36.6885L26.1099 30.3457H28.9326L26.4262 40.4609H23.4737L21.892 34.6947L20.3427 40.4609H17.3983L14.8838 30.3457H17.7146L19.0692 36.6885L20.6915 30.3457H23.1087L24.7553 36.6885Z"
                    fill="#3B3D3E"
                  />
                  <path
                    d="M40.4897 36.6885L41.8442 30.3457H44.667L42.1606 40.4609H39.2081L37.6264 34.6947L36.0771 40.4609H33.1327L30.6182 30.3457H33.449L34.8036 36.6885L36.4259 30.3457H38.8431L40.4897 36.6885Z"
                    fill="#3B3D3E"
                  />
                  <path
                    d="M56.224 36.6885L57.5786 30.3457H60.4014L57.895 40.4609H54.9424L53.3607 34.6947L51.8115 40.4609H48.8671L46.3525 30.3457H49.1834L50.538 36.6885L52.1603 30.3457H54.5774L56.224 36.6885Z"
                    fill="#3B3D3E"
                  />
                  <path
                    d="M65.1937 -4.03205e-07C70.2881 -1.80521e-07 74.418 4.12984 74.418 9.22426L74.418 19.5078L-0.000634092 19.5078L-0.000633643 9.22426C-0.00063342 4.12984 4.12921 -3.07242e-06 9.22363 -2.84974e-06L65.1937 -4.03205e-07Z"
                    fill="#FF8246"
                  />
                  <circle cx="20.0522" cy="10.1151" r="2.89004" fill="white" />
                  <circle cx="29.0522" cy="10.1151" r="2.89004" fill="white" />
                  <circle cx="11.0522" cy="10.1151" r="2.89004" fill="white" />
                </svg>
              </div>
              <p class="mb-0">
                Возможность <br />подключения своего <br />домена
              </p>
            </div>
          </b-col>
          <b-col md="4" lg="3" class="text-lg-center mb-4">
            <div class="free__box blue h-100">
              <div class="free__box__pic mb-3">
                <svg
                  width="66"
                  height="59"
                  viewBox="0 0 66 59"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M3.15648 1.52344H37.7774L45.8472 9.6882V55.5775C45.8472 56.7398 45.0573 57.4444 44.1907 57.4444H3.15648C2.36359 57.4444 1.5 56.7065 1.5 55.5775V3.39035C1.5 2.26135 2.36359 1.52344 3.15648 1.52344Z"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <path
                    d="M9.10547 18.2339H32.7791M9.10547 26.4286H25.4949"
                    stroke="#484848"
                    stroke-width="2.76003"
                  />
                  <path
                    d="M51.8086 10.9492L60.9842 20.2259L35.5038 45.9869C34.9727 46.5238 34.7072 46.7923 34.3993 46.9882C34.1026 47.1769 33.7776 47.3157 33.4369 47.3991C33.0833 47.4857 32.7078 47.4909 31.9569 47.5014L27.3598 47.5655C26.4617 47.578 26.0126 47.5843 25.6685 47.4164C25.3392 47.2556 25.0733 46.9869 24.9143 46.6539C24.7482 46.306 24.7544 45.852 24.7668 44.9439L24.8303 40.2963C24.8406 39.537 24.8458 39.1574 24.9314 38.8C25.0139 38.4555 25.1512 38.1269 25.3379 37.8269C25.5316 37.5156 25.7971 37.2472 26.3282 36.7103L51.8086 10.9492Z"
                    fill="#FF8246"
                  />
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M35.1933 45.2516L27.302 37.2731L29.0674 35.4883L36.9587 43.4668L35.1933 45.2516Z"
                    fill="#3B3D3E"
                  />
                  <path
                    d="M53.7905 8.94564C55.055 7.66722 57.1052 7.66722 58.3696 8.94564L62.9661 13.5927C64.2306 14.8711 64.2306 16.9439 62.9661 18.2223L57.6093 23.6381L48.4338 14.3614L53.7905 8.94564Z"
                    fill="#3B3D3E"
                  />
                </svg>
              </div>
              <p class="mb-0">
                Удобный редактор для <br />создания и правки <br />статей
              </p>
            </div>
          </b-col>
          <b-col md="4" lg="3" class="text-lg-center mb-4">
            <div class="free__box blue h-100">
              <div class="free__box__pic mb-3">
                <svg
                  width="59"
                  height="56"
                  viewBox="0 0 59 56"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M37.7922 39.5726L37.4507 39.3814H37.0594H5.71563C3.35597 39.3814 1.5 37.5846 1.5 35.3067V5.57474C1.5 3.29685 3.35597 1.5 5.71563 1.5H53.2844C55.644 1.5 57.5 3.29685 57.5 5.57474V35.3067C57.5 37.5846 55.644 39.3814 53.2844 39.3814H49.7812H48.2812V40.8814V49.1718C45.183 44.5143 40.9266 41.3276 37.7922 39.5726Z"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <rect x="8" y="35" width="27" height="6" fill="white" />
                  <path
                    d="M9.75048 51.0122C7.12686 48.3886 7.12686 44.1349 9.75048 41.5112L13.7092 37.5525C14.3651 36.8966 15.4286 36.8966 16.0845 37.5525C16.7404 38.2084 16.7404 39.2718 16.0845 39.9277L12.1257 43.8865C10.8139 45.1983 10.8139 47.3252 12.1257 48.637C13.4375 49.9488 15.5644 49.9488 16.8762 48.637L23.2102 42.303C24.522 40.9912 24.522 38.8643 23.2102 37.5525C22.5543 36.8966 22.5543 35.8332 23.2102 35.1773C23.8661 34.5214 24.9295 34.5213 25.5854 35.1773C28.2091 37.8009 28.2091 42.0546 25.5854 44.6782L19.2515 51.0122C16.6278 53.6358 12.3741 53.6358 9.75048 51.0122Z"
                    fill="#FF8246"
                  />
                  <path
                    d="M35.0864 25.6763C37.71 28.2999 37.71 32.5536 35.0864 35.1773L31.1277 39.136C30.4718 39.7919 29.4083 39.7919 28.7524 39.136C28.0965 38.4801 28.0965 37.4167 28.7524 36.7608L32.7112 32.802C34.023 31.4902 34.023 29.3633 32.7112 28.0515C31.3993 26.7397 29.2725 26.7397 27.9607 28.0515L21.6267 34.3855C20.3149 35.6973 20.3149 37.8242 21.6267 39.136C22.2826 39.7919 22.2826 40.8553 21.6267 41.5112C20.9708 42.1671 19.9074 42.1671 19.2515 41.5112C16.6278 38.8876 16.6278 34.6339 19.2515 32.0103L25.5854 25.6763C28.2091 23.0527 32.4628 23.0527 35.0864 25.6763Z"
                    fill="#FF8246"
                  />
                </svg>
              </div>
              <p class="mb-0">
                Быстрый доступ <br />из чата к необходимым <br />статьям
              </p>
            </div>
          </b-col>
          <b-col md="4" lg="3" class="text-lg-center mb-4">
            <div class="free__box blue h-100">
              <div class="free__box__pic mb-3">
                <svg
                  width="59"
                  height="56"
                  viewBox="0 0 59 56"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M37.7922 39.5726L37.4507 39.3814H37.0594H5.71563C3.35597 39.3814 1.5 37.5846 1.5 35.3067V5.57474C1.5 3.29685 3.35597 1.5 5.71563 1.5H53.2844C55.644 1.5 57.5 3.29685 57.5 5.57474V35.3067C57.5 37.5846 55.644 39.3814 53.2844 39.3814H49.7812H48.2812V40.8814V49.1718C45.183 44.5143 40.9266 41.3276 37.7922 39.5726Z"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="3"
                  />
                  <rect x="8" y="35" width="27" height="6" fill="white" />
                  <path
                    d="M9.75048 51.0122C7.12686 48.3886 7.12686 44.1349 9.75048 41.5112L13.7092 37.5525C14.3651 36.8966 15.4286 36.8966 16.0845 37.5525C16.7404 38.2084 16.7404 39.2718 16.0845 39.9277L12.1257 43.8865C10.8139 45.1983 10.8139 47.3252 12.1257 48.637C13.4375 49.9488 15.5644 49.9488 16.8762 48.637L23.2102 42.303C24.522 40.9912 24.522 38.8643 23.2102 37.5525C22.5543 36.8966 22.5543 35.8332 23.2102 35.1773C23.8661 34.5214 24.9295 34.5213 25.5854 35.1773C28.2091 37.8009 28.2091 42.0546 25.5854 44.6782L19.2515 51.0122C16.6278 53.6358 12.3741 53.6358 9.75048 51.0122Z"
                    fill="#FF8246"
                  />
                  <path
                    d="M35.0864 25.6763C37.71 28.2999 37.71 32.5536 35.0864 35.1773L31.1277 39.136C30.4718 39.7919 29.4083 39.7919 28.7524 39.136C28.0965 38.4801 28.0965 37.4167 28.7524 36.7608L32.7112 32.802C34.023 31.4902 34.023 29.3633 32.7112 28.0515C31.3993 26.7397 29.2725 26.7397 27.9607 28.0515L21.6267 34.3855C20.3149 35.6973 20.3149 37.8242 21.6267 39.136C22.2826 39.7919 22.2826 40.8553 21.6267 41.5112C20.9708 42.1671 19.9074 42.1671 19.2515 41.5112C16.6278 38.8876 16.6278 34.6339 19.2515 32.0103L25.5854 25.6763C28.2091 23.0527 32.4628 23.0527 35.0864 25.6763Z"
                    fill="#FF8246"
                  />
                </svg>
              </div>
              <p class="mb-0">
                Мобильное <br />приложение для <br />операторов
              </p>
            </div>
          </b-col>
          <b-col md="4" lg="3" class="text-lg-center mb-4">
            <div class="free__box blue h-100">
              <div class="free__box__pic mb-3">
                <svg
                  width="75"
                  height="57"
                  viewBox="0 0 75 57"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <rect
                    x="1.1814"
                    y="1.18237"
                    width="72.0558"
                    height="15.8622"
                    rx="4.4"
                    fill="white"
                    stroke="#3B3D3E"
                    stroke-width="2.36279"
                  />
                  <path
                    d="M51.6367 0H68.8365C71.919 0 74.4179 2.49888 74.4179 5.5814V12.6436C74.4179 15.7261 71.919 18.225 68.8365 18.225H51.6367V0Z"
                    fill="#FF8246"
                  />
                  <rect
                    x="6.07422"
                    y="22.7812"
                    width="15.1875"
                    height="15.1875"
                    rx="5.5814"
                    fill="#FF8246"
                  />
                  <path
                    d="M63.0103 10.9364C64.3952 10.6326 65.2716 9.26356 64.9678 7.87862C64.664 6.49367 63.295 5.61725 61.91 5.92107C60.5251 6.22489 59.6486 7.59391 59.9525 8.97886C60.2563 10.3638 61.6253 11.2402 63.0103 10.9364Z"
                    fill="white"
                    stroke="#484848"
                    stroke-width="1.86047"
                    stroke-miterlimit="10"
                  />
                  <path
                    d="M64.4434 9.86084L65.8503 10.7616"
                    stroke="#484848"
                    stroke-width="1.86047"
                    stroke-miterlimit="10"
                  />
                  <path
                    d="M67.5965 11.9134C67.5296 12.0179 67.3963 12.0471 67.2918 11.9802L65.6315 10.9174C65.527 10.8505 65.4978 10.7172 65.5647 10.6127C65.6316 10.5082 65.7649 10.4789 65.8694 10.5458L67.5296 11.6087C67.6341 11.6756 67.6634 11.8089 67.5965 11.9134Z"
                    fill="#484848"
                    stroke="#484848"
                    stroke-width="1.86047"
                    stroke-miterlimit="10"
                  />
                  <path
                    d="M25.8184 27.3374H56.1933"
                    stroke="#3B3D3E"
                    stroke-width="2.36279"
                  />
                  <path
                    d="M25.8184 33.4124H44.0433"
                    stroke="#3B3D3E"
                    stroke-width="2.36279"
                  />
                  <rect
                    x="6.07422"
                    y="41.0059"
                    width="15.1875"
                    height="15.1875"
                    rx="5.5814"
                    fill="#FF8246"
                  />
                  <path
                    d="M25.8184 45.5625H56.1933"
                    stroke="#3B3D3E"
                    stroke-width="2.36279"
                  />
                  <path
                    d="M25.8184 51.6377H44.0433"
                    stroke="#3B3D3E"
                    stroke-width="2.36279"
                  />
                </svg>
              </div>
              <p class="mb-0">Индексация всех <br />статей по SEO</p>
            </div>
          </b-col>
          <b-col class="col-12 col-md-8 col-lg-3 free__info">
            <div class="free__box">
              <p>
                Или снимите ограничения и добавьте аналитику, подключив
                дополнительный модуль.
              </p>
              <b-button href="/price/" variant="primary"
                >Узнать о тарифах</b-button
              >
            </div>
          </b-col>
        </b-row>
      </b-container>
    </section>

    <Consultation
      title="Запишитесь на бесплатную демонстрацию сервиса"
      text="Мы познакомимся, определим ваши задачи, за 30 минут обучим продукту и&nbsp;🎁&nbsp;бесплатно настроим базовый сценарий сбора лидов на вашем сайте"
      pic="medium-2.png"
      alt="Девочка, живущая в сети"
      bg="#fff3e6"
    />

    <Integrations />

    <Cases />

    <Study />

    <Logos />
  </Layout>
</template>

<script>
import Layout from "~/layouts/Default.vue";
import Consultation from "~/components/Consultation.vue";
import Integrations from "~/components/Integrations.vue";
import Cases from "~/components/Cases/Cases.vue";
import Study from "~/components/Study.vue";
import Logos from "~/components/Logos.vue";

export default {
  components: {
    Layout,
    Consultation,
    Integrations,
    Cases,
    Study,
    Logos,
  },
  data() {
    return {
      //Делаем в HEAD
      metaTitle:
        "База знаний для поддержки клиентов 24x7: Бесплатно пользователям",
      metaDescription:
        "Разгрузите операторов и сократите количество обращений в поддержку с помощью удобной базы знаний",
      metaCanonical: "https://www.carrotquest.io/knowledge-base/",
      metaImage:
        "https://www.carrotquest.io/assets/images/cover/ru/knowledge-base.gif",
    };
  },
};
</script>


<style lang="scss">
.page-knowledge-base {
  @media (min-width: 992px) {
    .hero {
      height: auto;
      max-height: initial;
      padding-top: 5rem;
      padding-bottom: 1px;
      &__pic {
        position: relative;
        z-index: 2;
        margin-top: 5rem;
      }
      &__book {
        position: absolute;
        z-index: 1;
        &-left {
          top: 200px;
          left: -300px;
        }
        &-right {
          top: 150px;
          right: -200px;
        }
      }
    }
  }

  .save {
    &__icon {
      position: absolute;
      left: 50%;
      margin-top: -35px;
      margin-left: 80px;
    }
  }

  .analitics {
    @media (min-width: 992px) {
      margin-top: -3rem;
      padding-top: 3rem;
      background: url("data:image/svg+xml,%0A%3Csvg width='1295' height='490' viewBox='0 0 1295 490' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath d='M487.2 260.873C406.933 260.873 417.317 87.5 343 87.5C278.58 87.5 282.333 321.5 229.133 321.5C196.125 321.5 195.557 260.873 164.015 260.873C116.253 260.873 78.4 490 0 490H1295C1259.52 490 1238.84 284.927 1196.05 284.927C1153.25 284.927 1171.52 385.151 1109.18 385.151C1035.77 385.151 1021.63 191.796 962.945 191.796C904.256 191.796 902.619 347.5 808.078 347.5C713.536 347.5 716.517 0 636.572 0C556.626 0 580.696 260.873 487.2 260.873Z' fill='%23F3F3FF'/%3E%3Cpath d='M487.2 260.873C406.933 260.873 417.317 87.5 343 87.5C278.58 87.5 282.333 321.5 229.133 321.5C196.125 321.5 195.557 260.873 164.015 260.873C116.253 260.873 78.4 490 0 490H1295C1259.52 490 1238.84 284.927 1196.05 284.927C1153.25 284.927 1171.52 385.151 1109.18 385.151C1035.77 385.151 1021.63 191.796 962.945 191.796C904.256 191.796 902.619 347.5 808.078 347.5C713.536 347.5 716.517 0 636.572 0C556.626 0 580.696 260.873 487.2 260.873Z' fill='url(%23paint0_linear)'/%3E%3Cdefs%3E%3ClinearGradient id='paint0_linear' x1='647.5' y1='466' x2='647.5' y2='120' gradientUnits='userSpaceOnUse'%3E%3Cstop stop-color='white'/%3E%3Cstop offset='0.533857' stop-color='white' stop-opacity='0'/%3E%3C/linearGradient%3E%3C/defs%3E%3C/svg%3E%0A")
        center top no-repeat;
    }
  }

  .seo {
    @media (min-width: 992px) {
      margin-top: -3rem;
      padding-top: 3rem;
      background: url("data:image/svg+xml,%0A%3Csvg width='1344' height='850' viewBox='0 0 1344 850' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath d='M823.88 193.048C829.064 153.794 860.787 60.2276 946.202 0C944.1 42.3388 916.694 140.223 823.88 193.048Z' fill='%23F3F3FF'/%3E%3Cpath d='M464.48 315.438C473.728 287.82 506.179 221.564 562.002 177.486C559.76 194.45 551.325 234.518 535.519 259.08C558.499 230.76 612.78 167.645 646.072 141.737C639.206 182.113 610.93 271.613 552.754 306.606C552.333 303.662 552.333 294.998 555.696 283.894C538.742 294.409 496.763 315.438 464.48 315.438Z' fill='%23F3F3FF'/%3E%3Cpath d='M130.722 388.199C130.722 374.46 138.036 340.757 167.292 315.858C170.515 328.756 167.713 361.282 130.722 388.199Z' fill='%23F3F3FF'/%3E%3Cpath d='M7.13857 503.439C7.83916 482.69 19.665 432.192 61.3638 396.19C63.7458 417.64 56.2355 469.119 7.13857 503.439Z' fill='%23F3F3FF'/%3E%3Cpath d='M711.226 229.218C710.245 216.32 716.018 183.459 746.956 155.195C747.376 173.14 740.819 213.068 711.226 229.218Z' fill='%23F3F3FF'/%3E%3Cpath d='M764.611 636.764C745.415 558.255 782.013 346.982 1081.98 129.96C1079.31 151.691 1063.9 213.741 1023.55 288.1C1040.78 273.239 1090.47 237.462 1151.33 213.236L1029.85 404.181C1099.07 356.655 1260.2 253.191 1351 219.545C1288.65 310.391 1134.52 513.701 1016.82 600.173C1049.89 594.285 1121.49 579.649 1143.35 568.209C1113.64 605.781 1016.74 694.132 866.756 746.957C871.52 722.703 886.68 664.775 909.211 627.091C879.086 651.625 812.11 705.319 785.208 723.825C794.596 682.047 817.827 590.079 835.65 556.432L764.611 636.764Z' fill='%23F3F3FF'/%3E%3Cpath d='M109.704 472.736C64.3062 524.216 29.1368 624.287 17.2269 667.887C-3.62251 763.78 -1.26854 829.251 2.51462 850C38.4966 791.455 87.2854 688.215 107.182 643.914C98.7749 667.13 91.3487 704.618 88.6865 720.46C105.501 699.263 138.008 649.942 152.159 627.932C139.133 664.025 121.987 728.83 114.892 757.316C113.469 759.609 113.712 759.368 114.748 757.892L114.892 757.316C118.469 751.549 132.577 729.753 171.075 671.252C224.88 589.49 275.322 453.81 293.818 396.19C279.021 410.322 212.83 503.299 181.584 548.021C192.009 526.487 227.963 406.985 244.637 349.926C201.929 394.339 117.27 527.693 80.2795 588.817C85.3237 569.639 101.998 503.439 109.704 472.736Z' fill='%23F3F3FF'/%3E%3C/svg%3E%0A")
        center top no-repeat;
    }
  }

  .free {
    @media (min-width: 768px) {
      .mb-4 {
        margin-bottom: 40px !important;
      }
    }
    &__box {
      border-radius: 5px;
      padding: 2rem 1rem;
      &__pic {
        height: 71px;
      }
    }
    .free__info {
      padding: 0;
    }
  }

  .blue {
    background-color: #f3f3ff;
  }
}
</style>