<template>
	<Layout class="page introduction-carrotquest-page">

		<div class="blue">
			<div class="hero">
				<b-container>
					<b-row class="align-items-center">
						<b-col lg="6">
							<h1>
								Внедрим Carrot quest  в ваш бизнес
							</h1>
							<p class="py-3">
								Разработаем и реализуемстратегии коммуникациис вашими пользователями.Увеличимконверсию  на каждомэтапе воронки
							</p>
							<b-button href="123" variant="primary" class="px-4">Отправить заявку на внедрение</b-button>
						</b-col>
					</b-row>
					<g-image class="hero__pic d-none d-lg-block no-retina" src="@/assets/images/introduction-carrotquest/hero.png" width="436" alt=" " />
					<g-image class="hero__pic d-none d-lg-block retina" src="@/assets/images/introduction-carrotquest/hero.png" width="872" alt=" " style="max-width: 436px;" />
				</b-container>
			</div>
		</div>

		<!-- Трудности -->
		<b-container class="hard">
			<b-row>
				<b-col lg="10" xl="8">
					<h2 class="h1">
						С какими трудностями сталкиваются компании в организации онлайн-продаж:
					</h2>
				</b-col>
			</b-row>
			<b-row class="font20px">
				<b-col md="6" lg="4">
					<div class="hard__box" style="background-color: #FFF1E5;">
						Оборот трафика увеличивается, а прибыль нет 🤔
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="hard__box" style="background-color: #EDEDFD;">
						Менеджеры тратят много времени на квалификацию пользователей и 👻 нецелевых клиентов 
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="hard__box" style="background-color: #FEE6EC;">
						Клиенты 😾 не возвращаются за повторными покупками
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="hard__box" style="background-color: #F0FDF0;">
						Конверсия в заявку или в первую 📦 покупку не растет
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="hard__box" style="background-color: #FEF8EA;">
						Пользователи не всегда завершают регистрацию 🔥 или оформляют заказ
					</div>
				</b-col>
			</b-row>
			<b-row>
				<b-col lg="10" xl="8" class="mt-4">
					<p>
						Решение этих узких мест в процессах поможет вам зарабатывать больше денег и вывести компанию на новый уровень
					</p>
				</b-col>
			</b-row>
		</b-container>

		<!-- Как мы решаем эти задачи -->
		<b-container class="success">
			<b-row class="mb-4">
				<b-col cols="12">
					<h2 class="h1">
						Как мы решаем эти задачи
					</h2>
				</b-col>
			</b-row>
			<b-row class="mb-5">
				<b-col lg="4" class="order-lg-1">
					<h3 class="h4">
						Собираем данные о пользователях
					</h3>
					<p>
						В специальной CRM для онлайн-бизнеса в реальном времени сохраняется каждый лид с вашего сайта, со всей историей его действий и коммуникаций с ним, используйте это для дальнейшего общения
					</p>
				</b-col>
				<b-col lg="8" class="order-lg-2">
					<g-image src="@/assets/images/introduction-carrotquest/1.png" width="720" alt="Собираем данные о пользователях" />
				</b-col>
			</b-row>
			<b-row class="mb-5">
				<b-col lg="4" class="order-lg-2">
					<h3 class="h4">
						Увеличиваемконверсиюна 20-100% с помощью поп-апов
					</h3>
					<ul>
						<li>Эффективность зависит от ниши и текущей проработки форм лидогенерации</li>
						<li>Не показываем одному пользователю несколько поп-апов за раз. Показываем  тогда, когда это актуально и эффективно.</li>
						<li>Следим, чтобы поп-апы не снижали поведенческие метрики (процент отказов, время первой сессии, глубина просмотров)</li>
						<li>Проводим А/Б тесты офферов в поп-апах, чтобы увеличить конверсию</li>
						<li>Стилизуем под ваш дизайн</li>
					</ul>
				</b-col>
				<b-col lg="8" class="order-lg-1">
					<g-image src="@/assets/images/introduction-carrotquest/2.png" width="720" alt="Увеличиваемконверсиюна 20-100% с помощью поп-апов" />
				</b-col>
			</b-row>
			<b-row class="mb-5">
				<b-col lg="4" class="order-lg-1">
					<h3 class="h4">
						Поднимаем ретеншн и повторные визиты с помощью триггерных рассылок
					</h3>
					<ul>
						<li>Так настроим триггерное письмо, чтобы оно пришло в нужный момент и подходило под запрос пользователя. Это увеличит Open Rate и Click Rate.</li>
						<li>Вставляем в письма блоки с похожими/рекомендованными товарами при наличии их на сайте</li>
						<li>Увеличиваем выручку от email-канала за счет тестирования разных гипотез и А/Б тестов</li>
					</ul>
				</b-col>
				<b-col lg="8" class="order-lg-2">
					<g-image src="@/assets/images/introduction-carrotquest/3.png" width="720" alt="Поднимаем ретеншн и повторные визиты с помощью триггерных рассылок" />
				</b-col>
			</b-row>
			<b-row class="mb-5">
				<b-col lg="4" class="order-lg-2">
					<h3 class="h4">
						Настраиваем бизнес-чат на вашем сайте и обучаем команду менеджеров
					</h3>
					<p>
						Продавайте с помощью онлайн-чата на сайте, консультируйте клиентов о товарах и услугах
					</p>
					<ul>
						<li>Помогаем объединить все каналы коммуникаций в одном месте</li>
						<li>Используем триггерные автосообщения в чате для повышения конверсии в начало диалога</li>
						<li>Консультируем по внедрению чата в компанию, учитывая бизнес-процессы</li>
					</ul>
				</b-col>
				<b-col lg="8" class="order-lg-1">
					<g-image src="@/assets/images/introduction-carrotquest/4.png" width="720" alt="Настраиваем бизнес-чат на вашем сайте и обучаем команду менеджеров" />
				</b-col>
			</b-row>
			<b-row>
				<b-col lg="4" class="order-lg-1">
					<h3 class="h4">
						Увеличиваем количество качественных лидов с помощью квалифицирующего лид-бота
					</h3>
					<ul>
						<li>Увеличиваем конверсию в лида на 20-100% в зависимости от ниши (по аналогии с поп-апами)</li>
						<li>Настраиваем лид-бот кампанию для квалификации по различным сегментам</li>
					</ul>
					<b-button href="123" variant="primary" class="px-4">Хочу решить эту задачу</b-button>
				</b-col>
				<b-col lg="8" class="order-lg-2">
					<g-image src="@/assets/images/introduction-carrotquest/5.png" width="720" alt="Увеличиваем количество качественных лидов с помощью квалифицирующего лид-бота" />
				</b-col>
			</b-row>
		</b-container>

		

		<Pipeline title="Автоворонка увеличивает конверсию на каждом этапе" />

		<Cases />

		<Study />
		
		<Logos />

	</Layout>
</template>

<script>
	import Pipeline 		from '~/components/Pipeline.vue'
	import Cases 			from '~/components/Cases/Cases.vue'
	import Study 			from '~/components/Study.vue'
	import Logos 			from '~/components/Logos.vue'

	export default {
		components: {
			Pipeline,
			Cases,
			Study,
			Logos
		},

		//Делаем в HEAD
		metaInfo() {
			return {
				title: 'Внедрение автоматизации маркетинга',
				meta: [
					{
						key: 'description',
						name: 'description',
                        content: 'Хотите полный комплекс инструментов Carrot quest? Мы готовы помочь вам увеличивать конверсию. Запустили уже более 20 проектов автоматизации маркетинга - станьте следующим.'
					},
					{
						property: "og:image",
						content: '/assets/images/cover/introduction-carrotquest.png'
					},
				],
				link: [
					{
						rel: 'canonical',
						href: 'https://www.carrotquest.io/introduction-carrotquest/'
					}
				]
			}
		},
	}	
</script>

<style lang="scss">
	.introduction-carrotquest {
		.hero {
			&__pic {
				position: absolute;
				z-index: 0;
				top: 50%;
				left: 60%;
				margin-top: -222px;
			}
		}
		
		.hard {
			.col-md-6 {
				margin-top: 1.5rem;
				margin-bottom: 1rem;
			}
			&__box {
				padding: 20px;
				height: 100%;
				min-height: 12rem;
				border-radius: 5px;
			}
		}

		.success {
			img {
				max-width: 100%;
				border-radius: 5px;
			}
		}

		.blue {
			background-color: #F5F6FE;
		}

		@media (max-width: 575.98px) {
			
		}
		@media (max-width: 767.98px) {
			.hard .col-md-6 {
				margin-top: 1rem;
				margin-bottom: 0.5rem;
			}
		}
	}
</style>