<template>
	<Layout class="page page-library">

		<!-- Главный экран -->
		<b-container class="hero">
			<div class="about row">
				<div class="col-12">
					<div class="h1" id="text">
						<h1 class="h1"><b>Библиотека Carrot quest.</b></h1>
						<p>
							Полезные <span class="book"></span>&nbsp;материалы про маркетинг и&nbsp;<span class="plane"></span>&nbsp;развитие продуктов, 
							а также инсайты от наших экспертов — всё это вы найдете в <span class="db"></span>&nbsp;библиотеке
						</p>
					</div>
					<p>
						Подпишитесь, чтобы получать еженедельный дайджест Carrot quest
					</p>
					<form class="library__form form-row__form form" action="javascript: void(0);">
						<input type="email" autocomplete="on" class="input-field form__field form__field__right-button" required name="email" placeholder="Введите электронную почту" />
						<input type="submit" value="Подписаться" class="btn btn-primary" />
					</form>
				</div> 
			</div>

			<div class="bg">
				<ul class="circles-container">
					<li class="circle"></li>
					<li class="circle"></li>
					<li class="circle"></li>
					<li class="circle"></li>
					<li class="circle"></li>
					<li class="circle"></li>
					<li class="circle"></li>
					<li class="circle"></li>
					<li class="circle"></li>
					<li class="circle"></li>
				</ul>
			</div>
		</b-container>

		<!-- Книги -->
		<b-container class="books">
			<div class="row">
				<div class="col-12 col-lg-8 col-xl-7">
					<p class="h1">
						Книги
					</p>
					<p>
						Собрали всю экспертизу команды Carrot quest в пошаговых руководствах по автоматизации 
						маркетинга и коммуникаций для интернет-магазинов и онлайн-сервисов.
					</p>
				</div>
			</div>

			<div class="row">
				<div class="col-12 col-lg-6">
					<div class="books__wrapper">
						<p>
							Полное руководство по коммуникациям и автоматизации воронки пользователей в интернет-магазинах
						</p>
						<g-link to="/ecom-book/">Посмотреть книгу</g-link>
						<g-link to="/ecom-book/">
							<g-image src="~/assets/images/library/book_ecom.png" width="360" alt="Полное руководство по коммуникациям и автоматизации воронки пользователей в интернет-магазинах" />
						</g-link>
					</div>
				</div>
				<div class="col-12 col-lg-6">
					<div class="books__wrapper peach">
						<p>
							Самый подробный гайд по автоматизации маркетинга для продакт-маркетологов и CEO онлайн-продуктов
						</p>
						<a href="/book-saas">Посмотреть книгу</a>
						<g-image src="~/assets/images/library/book_scripts.png" width="384" alt="Самый подробный гайд по автоматизации маркетинга для продакт-маркетологов и CEO онлайн-продуктов" />
					</div>
				</div>
			</div>
		</b-container>

		<!-- Книги -->
		<b-container class="courses">
			<div class="row">
				<div class="col-12 col-lg-8 col-xl-7">
					<p class="h1">
						Курсы
					</p>
				</div>
			</div>

			<div class="row courses_row">
				<div class="col-12 col-lg-6 course">
					<div class="courses__wrapper" @click="video">
						<g-image src="~/assets/images/library/courses_video.png" class="lazyload" loading="lazy" alt="Как увеличить продажи на том же трафике, используя инструменты Carrot quest" />
						<div class="box">
							<a href="/videocourse-online-sales/">
								Как увеличить продажи на том же трафике, используя инструменты Carrot quest
							</a>
							<p>
								Этот видеокурс посвящен увеличению онлайн-продаж на сайте без привлечения дополнительного трафика.
								Вы узнаете как собирать данные о пользователях и правильно взаимодействовать с ними с помощью сообщений в чат, поп-апов, 
								email-рассылок и чат-бота, а также строить воронки и анализировать эффективность коммуникаций.
							</p>
						</div>
					</div>
				</div>

				<div class="col-12 col-lg-6 course">
					<div class="courses__wrapper" @click="transformation">
						<g-image src="~/assets/images/library/courses_transformation.png" class="lazyload" loading="lazy"  alt="Digital-трансформация маркетинга и продаж" />
						<div class="box">
							<a href="/transformsales-course-part1">Digital-трансформация маркетинга и продаж</a>
							<p>
								Это первая часть большого контент-курса о том, как шаг за шагом перевести продажи и маркетинг в онлайн. В нем — наш опыт и набор готовых сценариев для вас, 
								чтобы вы могли по-новому взаимодействовать с клиентами, поддерживать пользователей и увеличивать продажи без дополнительных бюджетов на маркетинг.
							</p>
						</div>
					</div>
				</div>

				<div class="col-12 col-lg-6 course">
					<div class="courses__wrapper" @click="prodagi"> 
						<g-image src="~/assets/images/library/courses_prodagi.png" class="lazyload" loading="lazy" alt="Маркетинг на сайте: как продать в 2 раза больше, не увеличивая трафик" />
						<div class="box">
							<a href="/marketing-course/">Маркетинг на сайте: как продать в 2 раза больше, не увеличивая трафик</a>
							<p>
								Этот курс — выжимка опыта, который мы получили за 5 лет внедрения автоворонок для 400 сайтов. Все рекомендации можно внедрить за неделю. Разработчик не понадобится 🙂
							</p>
						</div>
					</div>
				</div>

				<div class="col-12 col-lg-6 course">
					<div class="courses__wrapper" @click="email">
						<g-image src="~/assets/images/library/courses_email.png" class="lazyload" loading="lazy" alt="Email-маркетинг за 8 шагов" />
						<div class="box">
							<a href="/kurs-email-marketing/">Email-маркетинг за 8 шагов</a>
							<p>
								Этот курс посвящен построению автоворонок на сайте с момента посещения до покупки. 
								Вы узнаете, как настраивать коммуникацию с клиентами с помощью поп-апов, емейлов и онлайн-чата.
							</p>
						</div>
					</div>
				</div>
			</div>

			<div class="row">
				<div class="col-12 col-lg-10">
					<p class="h1">
						Гайды
					</p>
					<p>
						В этом разделе вы найдете пошаговые руководства по определенным темам, которые помогут вам стать еще эффективнее. 
						Как построить квалификацию на сайте, создать качественную поддержку клиентов и научиться проводить продуктовые исследования — все ответы на эти вопросы вы найдете здесь 😉
					</p>
				</div>
			</div>

			<div class="row">
				<div class="col-12 col-lg-6 course"> 
					<div class="courses__wrapper" @click="userSupport">
						<g-image src="~/assets/images/library/gaid-po-podderzhke.png" class="lazyload" loading="lazy" alt="Гайд по поддержке пользователей" />
						<div class="box">
							<a href="/support-guide/">
								Гайд по поддержке пользователей
							</a>
							<p>
								Стратегия и цели в команде поддержки. Строим работу с обращениями, анализируем эффективность работы.
							</p>
						</div>
					</div>
				</div>
				<div class="col-12 col-lg-6 course"> 
					<div class="courses__wrapper" @click="user">
						<g-image src="~/assets/images/library/guide_user.png" class="lazyload" loading="lazy" alt="Гайд по квалификации пользователей на сайте" />
						<div class="box">
							<a href="/qualification-guide/">
								Гайд по квалификации пользователей на сайте
							</a>
							<p>
								Вы узнаете, как построить процесс по оценке лидов с помощью чат-бота и лид-магнитов.
							</p>
						</div>
					</div>
				</div>
			</div>
		</b-container>

	</Layout>
</template>

<script>
	import '~/assets/scss/library/books.scss'
	import '~/assets/scss/library/courses.scss'
	import '~/assets/scss/library/hero.scss'
	import '~/assets/scss/library/resources.scss'

	export default {
		metaInfo: {
			title: 'Библиотека | Полезные материалы про маркетинг'
		},
		methods: {
        }
	}
</script>