<template>
	<Layout class="page page-newyear">

		<div class="blue hero">
			<b-container>
				<b-row class="justify-content-center">
					<b-col xl="9">
						<div class="hero__title h2 text-md-center">
							До&nbsp;31&nbsp;декабря скидка&nbsp;40% при подписке на&nbsp;год.<br>
							Активируйте подписку сразу или по&nbsp;сертификату<br>
							до&nbsp;конца следующего года
						</div>
					</b-col>
				</b-row>

				<b-row class="hero__price">
					<b-col class="text-md-center">
						<a href="/price/">Посмотреть тарифы с&nbsp;новогодней скидкой</a>
					</b-col>
				</b-row>
				
				<!-- Фоновое изображение -->
				<g-image class="hero__pic d-none d-md-block" src="@/assets/images/newyear2021/hero.png" width="1980" height="804" alt=" " />
				<g-image class="hero__snow" src="@/assets/images/newyear2021/hero__snow.png" width="1980" height="804" alt=" " />
				
			</b-container>
		</div>

		<!-- Скидки -->
		<b-container class="sale">
			<b-row>
				<b-col id="sale" lg="6" class="mb-5 mb-lg-0">
					<div class="sale__box">
						<g-image class="sale__box__pic mb-4" src="@/assets/images/newyear2021/sale-1.png" width="281" height="264" alt="Подписка на 12 месяцев с удвоенной скидкой − 40%" />
						<div class="sale__box__title h3 mb-3">
							Подписка на&nbsp;12&nbsp;месяцев с&nbsp;удвоенной скидкой &minus; 40% 
						</div>
						<div class="sale__box__description">
							<p>
								До&nbsp;31&nbsp;декабря мы&nbsp;удваиваем обычную скидку до&nbsp;40%. Скидка действует только на&nbsp;подписку. Не&nbsp;распространяется на&nbsp;модули. Не&nbsp;сочетается со&nbsp;скидками по&nbsp;промокодам. Действует на&nbsp;любое количество сайтов.
							</p>
							<p>
								<a href="/price/">Посчитать тариф со&nbsp;скидкой</a>
							</p>
							<b-button href="/panel/toapp/subscription" variant="primary">Купить годовую подписку со&nbsp;скидкой прямо сейчас!</b-button>
						</div>
					</div>
				</b-col>
				<b-col id="certificate" lg="6">
					<div class="sale__box">
						<g-image class="sale__box__pic mb-4" src="@/assets/images/newyear2021/sale-2.png" width="314" height="264" alt="Сертификат на годовую подписку по новогодней цене" />
						<div class="sale__box__title h3 mb-3">
							Сертификат на&nbsp;годовую подписку по&nbsp;новогодней цене
						</div>
						<div class="sale__box__description">
							<p>
								Сертификат на&nbsp;годовую подписку&nbsp;&mdash; это оплаченный заранее годовой тариф по&nbsp;условиям новогодней акции, который вы&nbsp;сможете активировать в&nbsp;любой момент до&nbsp;31&nbsp;декабря 2021.
							</p>
							<p>
								Сертификат поможет не&nbsp;упустить новогоднюю скидку, если уже оплаченная подписка заканчивается после 31&nbsp;декабря.
							</p>
						</div>
						<b-button href="#open-chat" variant="primary">Купить сертификат на&nbsp;подписку со&nbsp;скидкой!</b-button>
					</div>
				</b-col>
			</b-row>
		</b-container>

		<!-- Инструкции -->
		<b-container id="instruction" class="instruction">
			<b-row class="justify-content-center">

				<g-image class="instruction__bg instruction__bg-1 d-none d-lg-block" src="@/assets/images/newyear2021/bg-1.png" width="223" height="438" alt="Ice Clcik" />
				<g-image class="instruction__bg instruction__bg-2 d-none d-lg-block" src="@/assets/images/newyear2021/bg-2.png" width="512" height="523" alt="Ice Ball" />

				<b-col cols="12">
					<g-image class="instruction__pic instruction__pic-1" src="@/assets/images/newyear2021/instruction-1.png" width="245" height="207" alt="Money" />
				</b-col>
				<b-col lg="9" xl="8">
					<div class="h1">
						Как купить сертификат на&nbsp;годовую подписку?
					</div>
					<div class="instruction__box mt-4">
						<p>
							1. <b>Выберите тариф</b>. Помните, что в&nbsp;акции участвуют только подписки на&nbsp;12&nbsp;месяцев 
							(если ваш трафик близок к&nbsp;квоте, мы&nbsp;рекомендуем брать подписку &laquo;на&nbsp;вырост&raquo;; 
							но&nbsp;позже вы&nbsp;сможете перейти на&nbsp;тариф выше).
						</p>
					</div>
					<div class="instruction__box mt-4">
						<p>
							2. <b>Напишите в&nbsp;чат поддержки, что вы&nbsp;хотите участвовать в&nbsp;новогодней акции</b>, 
							и&nbsp;сообщить тариф, дополнительные модули и&nbsp;время активации подписки (сейчас или в&nbsp;позже в&nbsp;2021).
						</p>
					</div>
					<div class="instruction__box mt-4">
						<p>
							3. Мы&nbsp;сформируем счёт, который появится в&nbsp;вашем личном кабинете.
						</p>
					</div>
					<div class="instruction__box mt-4">
						<p>
							4. Оплатите этот счёт удобным способом. В&nbsp;случае, если вы&nbsp;планируете активировать 
							подписку не&nbsp;сразу, мы&nbsp;сообщим код активации.
						</p>
					</div>
					<div class="instruction__box mt-4">
						<p>
							5. Начните использовать Carrot quest для общения с&nbsp;клиентами и&nbsp;повышения конверсии.
						</p>
					</div>
				</b-col>
			</b-row>
			<b-row class="instruction__margin-top justify-content-center">

				<g-image class="instruction__bg instruction__bg-3 d-none d-lg-block" src="@/assets/images/newyear2021/bg-3.png" width="893" height="896" alt="Ice Snowflake" />

				<b-col cols="12">
					<g-image class="instruction__pic instruction__pic-2" src="@/assets/images/newyear2021/instruction-2.png" width="221" height="257" alt="Ball" />
				</b-col>
				<b-col lg="9" xl="8">
					<div class="h1">
						Как активировать подписку по&nbsp;сертификату?
					</div>
					<p>
						Напишите в&nbsp;чат поддержки, что вы&nbsp;хотите активировать сертификат, 
						и&nbsp;приготовьте код, который вы&nbsp;получили при покупке. Дальше мы&nbsp;уточним детали и&nbsp;включим подписку.
					</p>
					<b-button href="#open-chat" variant="primary">Купить сертификат на&nbsp;годовую подписку</b-button>
				</b-col>
			</b-row>
		</b-container>

		<b-container class="details">
			<b-row>
				<b-col cols="12">
					<div class="h1">
						Важные детали про годовой сертификат:
					</div>
				</b-col>
			</b-row>
			<b-row class="font20px">
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #FFF1E5;">
						Сертификат можно купить 📅 с&nbsp;7&nbsp;декабря до&nbsp;31&nbsp;декабря 2020 года
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #EDEDFD;">
						Активировать годовую подписку по&nbsp;сертификату по&nbsp;можно 🕐 до&nbsp;31&nbsp;декабря 2021 года
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #FEE6EC;">
						Если до&nbsp;31&nbsp;декабря 2021&nbsp;года. сертификат не&nbsp;активируется, он 🔥 сгорает и&nbsp;больше ничего не&nbsp;стоит
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #F0FDF0;">
						Сертификат можно оформить только на ⌛ годовую подписку
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #FEF8EA;">
						Подписку по&nbsp;сертификату можно применить к ✌️ любому сайту
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #F3F3FF;">
						Скидка не&nbsp;распространяется на&nbsp;модули, но&nbsp;обязательно скажите, 🤝 если вы&nbsp;хотите включить их&nbsp;в&nbsp;подписку или сертификат
					</div>
				</b-col>
			</b-row>
			<b-row>
				<b-col class="mt-4">
					<b-button href="#open-chat" variant="primary">Купить сертификат на&nbsp;годовую подписку</b-button>
				</b-col>
			</b-row>
		</b-container>


		<Contacts 
			title="Есть вопросы? Обращайтесь"
			pic="newyear2021/small-snegurochkaBookPro.png"
			alt="СнегурочкаБук Про"
			bg="#FFEAD2"
		/>


		<FAQ 
			title="Вопросы, которые у вас могут быть:"
			:items="[
				{
					question: 'Какой период действия акции?',
					answer: '<p>Купить тариф по&nbsp;новогодней акции со&nbsp;скидкой&nbsp;40% или сертификат можно до&nbsp;31&nbsp;декабря 2020&nbsp;включительно, а&nbsp;активировать&nbsp;&mdash; до&nbsp;31&nbsp;декабря 2021. Успевайте!</p>'
				},
				{
					question: 'Как воспользоваться новогодней акцией?',
					answer: '<ol><li>Выберите тариф. Помните, что в&nbsp;акции участвуют только подписки на&nbsp;12&nbsp;месяцев (если ваш трафик близок к&nbsp;квоте, мы&nbsp;рекомендуем брать подписку &laquo;на&nbsp;вырост&raquo;; но&nbsp;позже вы&nbsp;сможете перейти на&nbsp;тариф выше).</li> <li>Напишите в&nbsp;чат поддержки, что вы&nbsp;хотите участвовать в&nbsp;новогодней акции, и&nbsp;сообщить тариф, дополнительные модули и&nbsp;время активации подписки (сейчас или в&nbsp;позже в&nbsp;2021).</li> <li>Мы&nbsp;сформируем счёт, который появится в&nbsp;вашем личном кабинете.</li> <li>Оплатите этот счёт удобным способом.</li> <li>В&nbsp;случае, если вы&nbsp;планируете активировать подписку не&nbsp;сразу, мы&nbsp;сообщим код активации.</li> <li>Начните использовать Carrot quest для общения с&nbsp;клиентами и&nbsp;повышения конверсии.</li></ol>'
				},
				{
					question: 'Что даёт сертификат на&nbsp;годовую подписку?',
					answer: '<p>Если вы&nbsp;не&nbsp;готовы активировать подписку прямо сейчас (например, сайт еще не&nbsp;готов или у&nbsp;вас не&nbsp;закончилась действующая подписка), вы&nbsp;можете оплатить тариф на&nbsp;год сейчас с&nbsp;новогодней скидкой, а&nbsp;активировать позже. Просто назовите нам номер сертификата, который получите при покупке.</p>'
				},
				{
					question: 'Как активировать подписку по&nbsp;сертификату?',
					answer: '<p>Напишите в&nbsp;чат поддержки, что вы&nbsp;хотите активировать сертификат, и&nbsp;приготовьте код, который вы&nbsp;получили при покупке. Дальше мы&nbsp;уточним детали и&nbsp;включим подписку.</p>'
				},
				{
					question: 'Что если у&nbsp;меня изменится тариф?',
					answer: '<p>Если вы&nbsp;поймёте, что необходим более высокий тариф, вы&nbsp;можете доплатить разницу с&nbsp;учётом использованных квот и&nbsp;скидок. Напишите в&nbsp;поддержку, мы&nbsp;всё пересчитаем и&nbsp;поможем перейти на&nbsp;другой тариф. Переход на&nbsp;более низкий тариф и&nbsp;пересчёт остатка не&nbsp;предусмотрен.</p>'
				},
				{
					question: 'Мой оплаченный период кончается после окончания акции. Что мне делать?',
					answer: 'Ничего страшного! Вы&nbsp;можете купить сертификат на&nbsp;будущее. Как только подойдет время, активируйте сертификат с&nbsp;помощью нашей поддержки и&nbsp;продолжайте использовать Carrot quest.'
				},
				{
					question: 'Скидка 40% распространяется на&nbsp;модули?',
					answer: 'Нет. Скидка распространяется только на&nbsp;подписку, но&nbsp;обязательно скажите нам, если вы&nbsp;хотите включить в&nbsp;тариф или сертификат дополнительные модули.'
				},
				{
					question: 'В течение какого периода я&nbsp;могу активировать подписку по&nbsp;сертификату?',
					answer: 'Вы можете активировать подписку с&nbsp;момента покупки и&nbsp;до&nbsp;31&nbsp;декабря 2021 г.'
				},
				{
					question: 'Могу&nbsp;ли я&nbsp;купить несколько сертификатов?',
					answer: '<ol><li>Вы&nbsp;можете купить любое количество сертификатов.</li> <li>Для будущего сайта: если вы&nbsp;готовитесь к&nbsp;запуску новых проектов, купите любое необходимое количество сертификатов, а&nbsp;активируйте, когда будете готовы.</li> <li>Для друга: сертификат, который вы&nbsp;получите у&nbsp;поддержки для активации подписки, можно передавать третьим лицам.</li> <li>Для текущего сайта: если у&nbsp;вас сейчас уже действует подписка, вы&nbsp;можете купить сертификат на&nbsp;будущее. Но&nbsp;помните, что активировать сертификат можно только до&nbsp;31&nbsp;декабря 2021.</li></ol>'
				},
				{
					question: 'Могу&nbsp;ли я&nbsp;просто положить денег на&nbsp;баланс в&nbsp;счёт подписки по&nbsp;новогодней акции?',
					answer: '<p>Напишите в&nbsp;чат, что вы&nbsp;хотите участвовать в&nbsp;новогодней акции. Когда мы&nbsp;уточним все детали (тариф, дополнительные модули и&nbsp;подобные вопросы), вам будет выставлен счёт. Сумма на&nbsp;балансе засчитается в&nbsp;оплату счёта, но&nbsp;без общения с&nbsp;поддержкой новогоднего чуда не&nbsp;случится и&nbsp;скидка&nbsp;40% не&nbsp;применится.</p>'
				},
				{
					question: 'Год слишком много. Есть&nbsp;ли скидка на&nbsp;3&nbsp;или 6&nbsp;месяцев?',
					answer: '<p>Вы&nbsp;можете использовать стандартные скидки, которые действуют в&nbsp;течение всего года: 3&nbsp;месяца&nbsp;&mdash; 10%, 6&nbsp;месяцев&nbsp;&mdash; 15%.</p>'
				},
				{
					question: 'Могу&nbsp;ли я&nbsp;вернуть деньги за&nbsp;подписку, если не&nbsp;воспользуюсь ею&nbsp;в&nbsp;2021?',
					answer: '<p>Да. Если вы&nbsp;передумаете активировать подписку по&nbsp;сертификату, напишите в&nbsp;чат поддержки до&nbsp;31&nbsp;декабря 2021&nbsp;года.</p> <p>Если вы&nbsp;не&nbsp;активируете подписку и&nbsp;не&nbsp;оформите возврат до&nbsp;31&nbsp;декабря 2021, мы&nbsp;не&nbsp;сможем вернуть вам деньги.</p>'
				},
				{
					question: 'У меня архивный тариф. Я&nbsp;могу участвовать в&nbsp;акции?',
					answer: '<p>Чтобы воспользоваться скидкой по&nbsp;новогодней акции, необходимо перейти с&nbsp;архивного тарифа на&nbsp;актуальный, и&nbsp;к&nbsp;нему уже применится скидка.</p>'
				},
			]"
		/>

		<Logos />

		<Consultation 
			title="Запишитесь на бесплатную демонстрацию сервиса" 
			text="Мы познакомимся, определим ваши задачи, за 30 минут обучим продукту и&nbsp;🎁&nbsp;бесплатно настроим базовый сценарий сбора лидов на вашем сайте"
			pic="medium-snegurochka.png"
			alt="Снегурочка"
			bg="#FFEAD2"
		/>		

	</Layout>
</template>

<script>
	import Contacts from '~/components/Contacts.vue'
	import FAQ from '~/components/FAQ.vue'
	import Logos from '~/components/Logos.vue'
	import Consultation from '~/components/Consultation.vue'

	export default {
		components: {
			Contacts,
			Consultation,
			FAQ,
			Logos
		},

		//Делаем в HEAD
		metaInfo() {
			return {
				title: 'Только до 31 декабря. Скидки на Carrot quest – 40% при покупке годовой подписки. 🤘 🎄',
				meta: [
					{
						key: 'description',
						name: 'description',
						content: 'Carrot quest — сервис для увеличения продаж, автоматизации маркетинга, улучшения коммуникации с клиентами ✔️онлайн-консультант ✔️чат-боты ✔️поп-ап окна ✔️триггерные письма ✔️eCRM'
					},
					{
						property: "og:image",
						content: '/assets/images/cover/newyear2021.jpg'
					},
				],
				link: [
					{
						rel: 'canonical',
						href: 'https://www.carrotquest.io/newyear2021/'
					}
				]
			}
		},
		mounted () {
			// Ищем ссылки для открытия чата
			if ( document.querySelector('[href="#open-chat"]') ) {
				document.querySelectorAll('[href="#open-chat"]').forEach(function(item) {
					item.addEventListener('click', function(e) {
						e.preventDefault()
						carrotquest.open()
						function sayHi() {
							$('#carrot-messenger-frame').contents().find('#carrotquest-messenger-reply-textarea').html('Я хочу сертификат на годовую подписку по акции')
							$('#carrot-messenger-frame').contents().find('#carrotquest-messenger-reply-button').click()
						}
						setTimeout(sayHi, 1000);
					})
				})
			}
		}
	}	
</script>



<style lang="scss">
	.page-newyear {
		overflow: hidden;
		.blue {
			margin-bottom: 9rem;
			background-color: #EEEDFD;
		}

		//Главный экран
		.hero {
			background: #EAEAFC;
			overflow: hidden;
			height: 800px;
			.row {
				position: relative;
				z-index: 10;
			}
			&__title {
				margin-top: 5rem;
			}
			&__price {
				height: auto;
				margin-top: -2rem;
			}
			&__pic {
				position: absolute;
				z-index: 5;
				top: 0;
				left: 50%;
				margin-left: -990px;
			}
			&__snow {
				position: absolute;
				z-index: 6;
				top: 0;
				left: 0;
				width: 100%;
				height: 100%;
			}

		}

		//Скидки
		.sale {
			margin-top: -3rem;
			&__box {
				position: relative;
				background-color: #F8F8FF;
				border-radius: 5px;
				height: 100%;
				padding: 2rem 2rem 4.5rem 2rem;
				&__pic {
					display: block;
					margin: 0 auto;
				}
				.btn {
					position: absolute;
					bottom: 2rem;
					max-width: 100%;
				}
			}
		}

		//Инструкции
		.instruction {
			.row {
				position: relative;
			}
			&__box {
				background-color: #F8F8FF;
				border-radius: 5px;
				padding: 1rem 1rem 0.1rem 1rem;
			}
			&__margin-top {
				margin-top: 7rem;
			}
			&__bg {
				position: absolute;
				z-index: -1;
				&-1 {
					right: 0;
					top: -14rem; 
				}
				&-2 {
					right: 0;
					top: 14rem; 
					margin-right: -300px;
				}
				&-3 {
					left: 0;
					bottom: -11rem;
				}
			}
			&__pic {
				position: absolute;
				&-1 {
					left: 0;
					margin-left: -100px; 
				}
				&-2 {
					right: 0;
					margin-right: -40px; 
				}
			}
		}

		//Детали
		.details {
			.col-md-6 {
				margin-top: 1.5rem;
				margin-bottom: 1rem;
			}
			&__box {
				padding: 20px;
				height: 100%;
				min-height: 12rem;
				border-radius: 5px;
			}
		}

		.Contacts , .FAQ {
			margin-top: -3rem;
		}

		@media (max-width: 767.98px) {
			.hero {
				height: auto !important;
				min-height: auto !important;
				padding-bottom: 4rem;
				&__snow {
					top: inherit;
					bottom: 0;
				}
				&__price {
					margin-top: 1rem;
				}
			}
			.sale__box__pic {
				width: auto;
				height: 160px;
				margin: 0
			}
			.instruction {
				&__margin-top {
					margin-top: 2.5rem;
				}
				&__pic {
					height: 100px;
				}
			}
			.details .col-md-6 {
				margin-top: 1rem;
				margin-bottom: 0.5rem;
			}
		}
		@media (max-width: 991.98px) {
			.instruction__pic {
				position: relative;
				margin-bottom: 1rem;
				width: auto;
				height: 180px;
				&-1 {
					margin-left: -20px !important;
				}
			}
			.sale__box {
				padding-bottom: 2rem;
				.btn {
					position: relative !important;
					bottom: 0;
				}
			}
		}
		@media (max-width: 1199.98px) {
			.instruction__pic {
				&-1 {
					left: 0;
					margin-left: -170px; 
				}
				&-2 {
					right: 0;
					margin-right: -80px; 
				}
			}
		}
		@media (max-width: 1399.98px) {
			.hero {
				height: 600px;
				&__title {
					margin-top: 4rem;
				}
				&__pic {
					width: 1477px;
					height: 600px;
					margin-left: -738px;
				}
				&__snow {
					width: 1477px;
					height: 600px;
					margin-left: -738px;
					left: 50%;
				}
			}
		}
	}
</style>