<template>
	<Layout class="page page-newyear">

		<div class="blue hero">
			<b-container>
				<b-row class="justify-content-center">
					<b-col xl="9">
						<div class="hero__title h2 text-center">
							До 31 декабря скидка 40% при подписке на год.<br>
							Активируйте подписку сразу или по сертификату<br>
							до конца следующего года
						</div>
					</b-col>
				</b-row>

				<b-row class="hero__price">
					<b-col class="text-center">
						<a href="/price/">Посмотреть тарифы с новогодней скидкой</a>
					</b-col>
				</b-row>
				
				<!-- Фоновое изображение -->
				<g-image class="hero__pic" src="@/assets/images/newyear2021/hero.png" width="1980" height="804" alt=" " />
				
			</b-container>
		</div>

		<!-- Скидки -->
		<b-container class="sale">
			<b-row>
				<b-col lg="6" class="mb-5 mb-lg-0">
					<div class="sale__box">
						<g-image class="sale__box__pic mb-4" src="@/assets/images/newyear2021/sale-1.png" width="281" height="264" alt="Подписка на 12 месяцев с удвоенной скидкой − 40%" />
						<div class="sale__box__title h3 mb-3">
							Подписка на 12 месяцев с удвоенной скидкой − 40% 
						</div>
						<div class="sale__box__description">
							<p>
								До 31 декабря мы удваиваем обычную скидку до 40%. Скидка действует только на подписку. Не распространяется на модули. Не сочетается со скидками по промокодам. Действует на любое количество сайтов.
							</p>
							<p>
								<a href="/price/">Посчитать тариф со скидкой</a>
							</p>
							<b-button href="#" variant="primary">Купить годовую подписку со скидкой прямо сейчас!</b-button>
						</div>
					</div>
				</b-col>
				<b-col lg="6">
					<div class="sale__box">
						<g-image class="sale__box__pic mb-4" src="@/assets/images/newyear2021/sale-2.png" width="314" height="264" alt="Сертификат на годовую подписку по новогодней цене" />
						<div class="sale__box__title h3 mb-3">
							Сертификат на годовую подписку по новогодней цене
						</div>
						<div class="sale__box__description">
							<p>
								Сертификат на годовую подписку — это оплаченный заранее годовой тариф по условиям новогодней акции, который вы сможете активировать в любой момент до 31 декабря 2021.
							</p>
							<p>
								Сертификат поможет не упустить новогоднюю скидку, если уже оплаченная подписка заканчивается после 31 декабря.
							</p>
						</div>
						<b-button href="#open-chat" variant="primary">Купить сертификат на подписку со скидкой!</b-button>
					</div>
				</b-col>
			</b-row>
		</b-container>

		<!-- Инструкции -->
		<b-container class="instruction">
			<b-row class="justify-content-center">

				<g-image class="instruction__bg instruction__bg-1 d-none d-lg-block" src="@/assets/images/newyear2021/bg-1.png" width="223" height="438" alt="Ice Clcik" />
				<g-image class="instruction__bg instruction__bg-2 d-none d-lg-block" src="@/assets/images/newyear2021/bg-2.png" width="512" height="523" alt="Ice Ball" />

				<b-col cols="12">
					<g-image class="instruction__pic instruction__pic-1" src="@/assets/images/newyear2021/instruction-1.png" width="245" height="207" alt="Money" />
				</b-col>
				<b-col lg="9" xl="8">
					<div class="h1">
						Как купить сертификат на годовую подписку?
					</div>
					<div class="instruction__box mt-4">
						<p>
							1. <b>Выберите тариф</b>. Помните, что в акции участвуют только подписки на 12 месяцев 
							(если ваш трафик близок к квоте, мы рекомендуем брать подписку "на вырост"; 
							но позже вы сможете перейти на тариф выше).
						</p>
					</div>
					<div class="instruction__box mt-4">
						<p>
							2. <b>Напишите в чат поддержки, что вы хотите участвовать в новогодней акции</b>, 
							и сообщить тариф, дополнительные модули и время активации подписки (сейчас или в позже в 2021).
						</p>
					</div>
					<div class="instruction__box mt-4">
						<p>
							3. Мы сформируем счёт, который появится в вашем личном кабинете.
						</p>
					</div>
					<div class="instruction__box mt-4">
						<p>
							4. Оплатите этот счёт удобным способом. В случае, если вы планируете активировать 
							подписку не сразу, мы сообщим код активации.
						</p>
					</div>
					<div class="instruction__box mt-4">
						<p>
							5. Начните использовать Carrot quest для общения с клиентами и повышения конверсии.
						</p>
					</div>
				</b-col>
			</b-row>
			<b-row class="instruction__margin-top justify-content-center">

				<g-image class="instruction__bg instruction__bg-3 d-none d-lg-block" src="@/assets/images/newyear2021/bg-3.png" width="893" height="896" alt="Ice Snowflake" />

				<b-col cols="12">
					<g-image class="instruction__pic instruction__pic-2" src="@/assets/images/newyear2021/instruction-2.png" width="221" height="257" alt="Ball" />
				</b-col>
				<b-col lg="9" xl="8">
					<div class="h1">
						Как активировать подписку по сертификату?
					</div>
					<p>
						Напишите в чат поддержки, что вы хотите активировать сертификат, 
						и приготовьте код, который вы получили при покупке. Дальше мы уточним детали и включим подписку.
					</p>
					<b-button href="#open-chat" variant="primary">Купить сертификат на годовую подписку</b-button>
				</b-col>
			</b-row>
		</b-container>

		<b-container class="details">
			<b-row>
				<b-col cols="12">
					<div class="h1">
						Важные детали про годовой сертификат:
					</div>
				</b-col>
			</b-row>
			<b-row>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #FFF1E5;">
						Сертификат можно купить 📅 с 7 декабря до 31 декабря 2020 года
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #EDEDFD;">
						Активировать годовую подписку по сертификату по можно 🕐 до 31 декабря 2021 года
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #FEE6EC;">
						Если до 31 декабря 2021 года. сертификат не активируется, он 🔥 сгорает и больше ничего не стоит
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #F0FDF0;">
						Сертификат можно оформить только на ⌛ годовую подписку
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #FEF8EA;">
						Подписку по сертификату можно применить к ✌️ любому сайту
					</div>
				</b-col>
				<b-col md="6" lg="4">
					<div class="details__box" style="background-color: #F3F3FF;">
						Скидка не распространяется на модули, но обязательно скажите, 🤝 если вы хотите включить их в подписку или сертификат
					</div>
				</b-col>
			</b-row>
			<b-row>
				<b-col class="mt-4">
					<b-button href="#open-chat" variant="primary">Купить сертификат на годовую подписку</b-button>
				</b-col>
			</b-row>
		</b-container>


		<Contacts 
			title="Есть вопросы? Обращайтесь"
			pic="newyear2021/small-snegurochkaBookPro.png"
			alt="СнегурочкаБук Про"
			bg="#FFEAD2"
		/>


		<FAQ 
			title="Вопросы, которые у вас могут быть:"
			:items="[
				{
					question: 'Какой период действия акции?',
					answer: '<p>Купить тариф по новогодней акции со скидкой 40% или сертификат можно до 31 декабря 2020 включительно, а активировать — до 31 декабря 2021. Успевайте!</p>'
				},
				{
					question: 'Как воспользоваться новогодней акцией?',
					answer: '<ol><li>Выберите тариф. Помните, что в акции участвуют только подписки на 12 месяцев (если ваш трафик близок к квоте, мы рекомендуем брать подписку «на вырост»; но позже вы сможете перейти на тариф выше).</li> <li>Напишите в чат поддержки, что вы хотите участвовать в новогодней акции, и сообщить тариф, дополнительные модули и время активации подписки (сейчас или в позже в 2021).</li> <li>Мы сформируем счёт, который появится в вашем личном кабинете.</li> <li>Оплатите этот счёт удобным способом.</li> <li>В случае, если вы планируете активировать подписку не сразу, мы сообщим код активации.</li> <li>Начните использовать Carrot quest для общения с клиентами и повышения конверсии.</li></ol>'
				},
				{
					question: 'Что даёт сертификат на годовую подписку?',
					answer: '<p>Если вы не готовы активировать подписку прямо сейчас (например, сайт еще не готов или у вас не закончилась действующая подписка), вы можете оплатить тариф на год сейчас с новогодней скидкой, а активировать позже. Просто назовите нам номер сертификата, который получите при покупке.</p>'
				},
				{
					question: 'Как активировать подписку по сертификату?',
					answer: '<p>Напишите в чат поддержки, что вы хотите активировать сертификат, и приготовьте код, который вы получили при покупке. Дальше мы уточним детали и включим подписку.</p>'
				},
				{
					question: 'Что если у меня изменится тариф?',
					answer: '<p>Если вы поймёте, что необходим более высокий тариф, вы можете доплатить разницу с учётом использованных квот и скидок. Напишите в поддержку, мы всё пересчитаем и поможем перейти на другой тариф. Переход на более низкий тариф и пересчёт остатка не предусмотрен.</p>'
				},
				{
					question: 'Мой оплаченный период кончается после окончания акции. Что мне делать?',
					answer: 'Ничего страшного! Вы можете купить сертификат на будущее. Как только подойдет время, активируйте сертификат с помощью нашей поддержки и продолжайте использовать Carrot quest.'
				},
				{
					question: 'Скидка 40% распространяется на модули?',
					answer: 'Нет. Скидка распространяется только на подписку, но обязательно скажите нам, если вы хотите включить в тариф или сертификат дополнительные модули.'
				},
				{
					question: 'В течение какого периода я могу активировать подписку по сертификату?',
					answer: 'Вы можете активировать подписку с момента покупки и до 31 декабря 2021 г.'
				},
				{
					question: 'Могу ли я купить несколько сертификатов?',
					answer: '<ol><li>Вы можете купить любое количество сертификатов.</li> <li>Для будущего сайта: если вы готовитесь к запуску новых проектов, купите любое необходимое количество сертификатов, а активируйте, когда будете готовы.</li> <li>Для друга: сертификат, который вы получите у поддержки для активации подписки, можно передавать третьим лицам.</li> <li>Для текущего сайта: если у вас сейчас уже действует подписка, вы можете купить сертификат на будущее. Но помните, что активировать сертификат можно только до 31 декабря 2021.</li></ol>'
				},
				{
					question: 'Могу ли я просто положить денег на баланс в счёт подписки по новогодней акции?',
					answer: '<p>Напишите в чат, что вы хотите участвовать в новогодней акции. Когда мы уточним все детали (тариф, дополнительные модули и подобные вопросы), вам будет выставлен счёт. Сумма на балансе засчитается в оплату счёта, но без общения с поддержкой новогоднего чуда не случится и скидка 40% не применится.</p>'
				},
				{
					question: 'Год слишком много. Есть ли скидка на 3 или 6 месяцев?',
					answer: '<p>Вы можете использовать стандартные скидки, которые действуют в течение всего года: 3 месяца — 10%, 6 месяцев — 15%.</p>'
				},
				{
					question: 'Могу ли я вернуть деньги за подписку, если не воспользуюсь ею в 2021?',
					answer: '<p>Да. Если вы передумаете активировать подписку по сертификату, напишите в чат поддержки до 31 декабря 2021 года.</p> <p>Если вы не активируете подписку и не оформите возврат до 31 декабря 2021, мы не сможем вернуть вам деньги.</p>'
				},
				{
					question: 'У меня архивный тариф. Я могу участвовать в акции?',
					answer: '<p>Чтобы воспользоваться скидкой по новогодней акции, необходимо перейти с архивного тарифа на актуальный, и к нему уже применится скидка.</p>'
				},
			]"
		/>

		<Logos />

		<Consultation 
			title="Запишитесь на бесплатную демонстрацию сервиса" 
			text="Мы познакомимся, определим ваши задачи, за 30 минут обучим продукту и&nbsp;🎁&nbsp;бесплатно настроим базовый сценарий сбора лидов на вашем сайте"
			pic="medium-snegurochka.png"
			alt="Снегурочка"
			bg="#FFEAD2"
		/>		

	</Layout>
</template>

<script>
	import Contacts from '~/components/Contacts.vue'
	import FAQ from '~/components/FAQ.vue'
	import Logos from '~/components/Logos.vue'
	import Consultation from '~/components/Consultation.vue'

	export default {
		components: {
			Contacts,
			Consultation,
			FAQ,
			Logos
		},

		//Делаем в HEAD
		metaInfo() {
			return {
				title: 'Инструменты для увеличения продаж на сайтах без привлечения нового трафика',
				meta: [
					{
						key: 'description',
						name: 'description',
						content: 'Carrot quest — сервис для увеличения продаж, автоматизации маркетинга, улучшения коммуникации с клиентами ✔️онлайн-консультант ✔️чат-боты ✔️поп-ап окна ✔️триггерные письма ✔️eCRM'
					},
					{
						property: "og:image",
						content: 'https://www.carrotquest.io/img/cover.gif'
					},
				],
				link: [
					{
						rel: 'canonical',
						href: 'https://www.carrotquest.io/newyear2021/'
					}
				]
			}
		}
	}	
</script>



<style lang="scss">
	.page-newyear {
		overflow: hidden;
		.blue {
			margin-bottom: 9rem;
			background-color: #F5F6FE;
		}

		//Главный экран
		.hero {
			background: #EAEAFC;
			overflow: hidden;
			height: 800px;
			.row {
				position: relative;
				z-index: 10;
			}
			&__title {
				margin-top: 6rem;
			}
			&__price {
				height: auto;
				margin-top: -2rem;
			}
			&__pic {
				position: absolute;
				z-index: 5;
				top: 0;
				left: 50%;
				margin-left: -990px;
			}
		}

		//Скидки
		.sale {
			&__box {
				background-color: #F8F8FF;
				border-radius: 5px;
				padding: 20px;
				height: 100%;
				&__pic {
					display: block;
					margin: 0 auto;
				}
			}
		}

		//Инструкции
		.instruction {
			.row {
				position: relative;
			}
			&__box {
				background-color: #F8F8FF;
				border-radius: 5px;
				padding: 1rem 1rem 0.1rem 1rem;
			}
			&__margin-top {
				margin-top: 7rem;
			}
			&__bg {
				position: absolute;
				z-index: -1;
				&-1 {
					right: 0;
					top: -14rem; 
				}
				&-2 {
					right: 0;
					top: 14rem; 
					margin-right: -300px;
				}
				&-3 {
					left: 0;
					bottom: -11rem;
				}
			}
			&__pic {
				position: absolute;
				&-1 {
					left: 0;
					margin-left: -60px; 
				}
				&-2 {
					right: 0;
					margin-right: -40px; 
				}
			}
		}

		//Детали
		.details {
			.col-md-6 {
				margin-top: 1.5rem;
				margin-bottom: 1rem;
			}
			&__box {
				padding: 20px;
				height: 100%;
				min-height: 9rem;
				border-radius: 5px;
			}
		}

		@media (max-width: 767.98px) {
			.sale__box__pic {
				width: auto;
				height: 160px;
				margin: 0
			}
			.instruction {
				&__margin-top {
					margin-top: 2.5rem;
				}
				&__pic {
					height: 100px;
				}
			}
			.details .col-md-6 {
				margin-top: 1rem;
				margin-bottom: 0.5rem;
			}
		}
		@media (max-width: 991.98px) {
			.instruction__pic {
				position: relative;
				margin-bottom: 1rem;
				width: auto;
				height: 180px;
				&-1 {
					margin-left: -20px !important;
				}
			}
		}
		@media (max-width: 1199.98px) {
			.instruction__pic {
				&-1 {
					left: 0;
					margin-left: -130px; 
				}
				&-2 {
					right: 0;
					margin-right: -80px; 
				}
			}
		}
		@media (max-width: 1399.98px) {
			.hero {
				height: 600px;
				&__title {
					margin-top: 4rem;
				}
				&__pic {
					width: 1477px;
					height: 600px;
					margin-left: -738px;
				}
			}
		}
	}
</style>