<template>
	<Layout :header="true" :footer="true"  class="page page-price">

		<div class="calculate">
			<b-container>
				<b-row>
					<b-col lg="8">
						<div class="h2 mt-5 mb-3 mb-lg-5">
							Мы помогаем онлайн-бизнесу общаться с клиентами и увеличивать их число
						</div>
					</b-col>
				</b-row>
				<b-row>
					<b-col class="calc mb-5">
						<div class="calc__select">
							<div class="calc__top">
								<h5>
									Цена тарифа зависит от количества уникальных посетителей сайта в месяц
								</h5>
								<p class="font14px mt-3">
									Уникальными посетителями считаются те, кто пришел один и более раз на сайт в течение месяца.
								</p>
							</div>
							<div class="calc__select__lids font20px d-none d-md-block mb-3">
								<b v-if="billingIndex < ( billing.length - 1 )">
									до {{ billing[billingIndex].toLocaleString('ru') }}
								</b>
								<b v-else>
									более 2 500 000
								</b>
								<br>
								уников в месяц
							</div>
							<div class="d-none d-md-block">
								<b-form-input v-model="billingIndex" type="range" min="0" :max="billing.length-1"></b-form-input>
							</div>
							<div class="d-block d-md-none">
								<select name="select" v-model="billingIndex" class="calc__select__mobile w-100 p-2">
									<option value="0">до 1 000 уников в месяц</option>
									<option value="1">до 10 000 уников в месяц</option>
									<option value="2">до 30 000 уников в месяц</option>
									<option value="3">до 60 000 уников в месяц</option>
									<option value="4">до 100 000 уников в месяц</option>
									<option value="5">до 150 000 уников в месяц</option>
									<option value="6">до 200 000 уников в месяц</option>
									<option value="7">до 300 000 уников в месяц</option>
									<option value="8">до 400 000 уников в месяц</option>
									<option value="9">до 500 000 уников в месяц</option>
									<option value="10">более 500 000 уников в месяц</option>
								</select>
							</div>
							<div class="calc__select__time font14px mt-4 mt-lg-5">
								<b-form-group label="Варианты оплаты:" v-model="ratioIndex">
									<b-form-radio v-model="ratioIndex" value="0">
										Оплата на месяц
									</b-form-radio>
									<b-form-radio v-model="ratioIndex" value="1">
										Оплата на 3 месяца <span>скидка 10%</span>
									</b-form-radio>
									<b-form-radio v-model="ratioIndex" value="2">
										Оплата на 6 месяцев <span>скидка 15%</span>
									</b-form-radio>
									<b-form-radio v-model="ratioIndex" value="3" class="year">
										Оплата на год <span>скидка 20%</span>
									</b-form-radio>
								</b-form-group>
							</div>
							<p class="peace">
								✌️ <i>Количество подключенных операторов не влияет на цену подписки</i>
							</p>
						</div>
						<div class="calc__rate">
							<b-row class="row row__box">
								<!-- Бизнес-чат -->
								<b-col lg="4" class="buisness">
									<div class="calc__top">
										<g-image src="@/assets/images/components/small-5.png" fit="contain" background="transparent" position="left" height="66" alt="business" />
										<div class="h5 my-3">
											Бизнес-чат
										</div>
										<div class="font14px grey-text">
											Лучше всего подходит для общения: продажи на сайте, поддержка в продукте
										</div>
									</div>
									<div class="calc__rate__price font20px">
										<template v-if="billingIndex < (billing.length-1)">
											<span id="price_before_sale" v-if="ratioIndex != 0">
												{{ buisness[billingIndex].price.toLocaleString('ru') }}
											</span>
											<b><span id="price">
												{{ ( buisness[billingIndex].price * ratio[ratioIndex] ).toLocaleString('ru') }}
											</span>₽ в месяц</b>
											<div class="calc__rate__emails font14px grey-text">
												<span class="emails">
													{{ buisness[billingIndex].emails.toLocaleString('ru') }}
												</span> писем в месяц
											</div>
										</template>
										<template v-else>
											<a href="#" class="open-chat" v-on:click.prevent>Связаться с нами в чате</a>
										</template>
									</div>
									<b-button :href="'/panel/register/?cq_event=clickedOnStartTrial&cq_event_plan=busineschat&cq_event_traffic=' + billing[billingIndex].number" variant="outline-primary" class="font14px w-100">
										Выбрать этот тариф
									</b-button>
									<a href="#" class="show d-md-none mt-4" v-on:click="showMoreAutomatization=!showMoreAutomatization">
										Подробнее
									</a>
									<b-row class="d-md-flex mt-4" :class="{ 'd-none' : !showMoreAutomatization }">
										<!-- <b-col class="font14px text">
											<p>
												<b>
													Основные особенности:
												</b>
											</p>
											<ul>
												<li>
													Чат на сайте и в вашем приложении
												</li>
												<li>
													Соцсети, мессенджеры и почта в одном окне
												</li>
												<li>
													<b-button id="button-1" variant="text" class="font14px">
														<span>Сообщения из чата догоняют клиента в почте</span>
													</b-button>
													<b-tooltip target="button-1" placement="top">
														<div class="font12px text-left">
															Когда лид уходит с сайта, сервис автоматически дублирует сообщения ему в почту, чтобы не потерять с ним связь
														</div>
													</b-tooltip>
												</li>
												<li>
													<b-button id="button-2" variant="text" class="font14px">
														<span>Командное общение с клиентом</span>
													</b-button>
													<b-tooltip target="button-2" placement="top">
														<div class="font12px text-left">
															Когда лиды пишут в чат, все диалоги приходят в общий канал и менеджеры могут помочь друг другу, подхватить или увидеть проблему
														</div>
													</b-tooltip>
												</li>
												<li>
													<b-button id="button-3" variant="text" class="font14px">
														<span>Автоназначение диалогов на операторов</span>
													</b-button>
													<b-tooltip target="button-3" placement="top">
														<div class="font12px text-left">
															Когда у вас много операторов и вам надо распределить входящие диалоги по ним, настраиваете правила назначения диалогов. И пьете смузи в шезлонге ;)
														</div>
													</b-tooltip>
												</li>
												<li>
													<b-button id="button-4" variant="text" class="font14px">
														<span>Lite версия базы знаний</span>
													</b-button>
													<b-tooltip target="button-4" placement="top">
														<div class="font12px text-left">
															Когда в поддержку валится много однотипных вопросов, база знаний помогает разгрузить операторов. А еще клиент может почитать ее самостоятельно (например, ночью).<br> Ограничение: до 30 статей и нет SEO настроек
														</div>
													</b-tooltip>
												</li>
												<li>
													Приложения iOS, Android, Windows
												</li>
											</ul>
											<p>
												<b>Сбор и квалификация лидов</b>
											</p>
											<ul>
												<li>
													<b-button id="button-5" variant="text" class="font14px">
														<span>База лидов с гибкой сегментацией</span>
													</b-button>
													<b-tooltip target="button-5" placement="top">
														<div class="font12px text-left">
															Когда пользователи приходят на сайт и оставляют контакты или пишут в чат, они сохраняются в базу лидов. Дальше вы сможете с ними работать — так вы не потеряете ни одного клиента
														</div>
													</b-tooltip>
												</li>
												<li>
													<b-button id="button-6" variant="text" class="font14px">
														<span>Триггерные сценарии поп-апов и чат-сообщений</span>
													</b-button>
													<b-tooltip target="button-6" placement="top">
														<div class="font12px text-left">
															Когда посетители сайта или лиды совершают событие (триггер), запускается сценарий, который собирает больше лидов или удерживает клиентов.<br> Через чат, поп-ап или email-сценарий
														</div>
													</b-tooltip>
												</li>
											</ul>
											<p>
												<b>
													Удержание и возвращение клиентов
												</b>
											</p>
											<ul>
												<li>
													<b-button id="button-7" variant="text" class="font14px">
														<span>Персонализированные емейл-рассылки</span>
													</b-button>
													<b-tooltip target="button-7" placement="top">
														<div class="font12px text-left">
															Когда вам надо вернуть лидов или рассказать новости, вы выделяете нужный сегмент и отправляете персонализированные email-рассылки
														</div>
													</b-tooltip>
												</li>
												<li>
													<b-button id="button-8" variant="text" class="font14px">
														<span>Триггерные email-кампании</span>
													</b-button>
													<b-tooltip target="button-8" placement="top">
														<div class="font12px text-left">
															Когда посетители сайта или лиды совершают событие (триггер), запускается сценарий, который собирает больше лидов или удерживает клиентов.<br> Через чат, поп-ап или email-сценарий
														</div>
													</b-tooltip>
												</li>
											</ul>
											<p>
												<b>
													Аналитика
												</b>
											</p>
											<ul>
												<li>
													<b-button id="button-9" variant="text" class="font14px">
														<span>А/Б-тесты автоматизации</span>
													</b-button>
													<b-tooltip target="button-9" placement="top">
														<div class="font12px text-left">
															Когда вы запускаете сценарий, вам надо проверить какой сценарий дает лучшие результаты. Чтобы отключить не работающие сценарии или запустить новый эксперимент.<br> С помощью АБ тестов автоматизации, контрольных групп и воронок сайта
														</div>
													</b-tooltip>
												</li>
												<li>
													<b-button id="button-10" variant="text" class="font14px">
														<span>Аналитика событий и воронки сайта</span>
													</b-button>
													<b-tooltip target="button-10" placement="top">
														<div class="font12px text-left">
															Когда вы ищете точки роста, вам надо понять, где в воронке сайта узкое место, и сформулировать гипотезы для улучшения метрик
														</div>
													</b-tooltip>
												</li>
											</ul>
											<p>
												<b>
													Дружелюбная техническая поддержка
												</b>
											</p>
										</b-col> -->
									</b-row>
								</b-col>
								<!-- Автоматизация -->
								<b-col lg="4" class="automatization">
									<div class="calc__top">
										<g-image src="@/assets/images/components/small-8.png" fit="contain" background="transparent" position="left" height="66" alt="business" />
										<div class="h5 my-3">
											Автоматизация
										</div>
										<div class="font14px grey-text">
											Лучше всего подходит для общения: продажи на сайте, поддержка в продукте
										</div>
									</div>
									<div class="calc__rate__price font20px">
										<template v-if="billingIndex < (billing.length-1)">
											<span id="price_before_sale" v-if="ratioIndex != 0">
												{{ automatisation[billingIndex].price.toLocaleString('ru') }}
											</span>
											<b><span id="price">
												{{ ( automatisation[billingIndex].price * ratio[ratioIndex] ).toLocaleString('ru') }}
											</span>₽ в месяц</b>
											<div class="calc__rate__emails font14px grey-text">
												<span class="emails">
													{{ automatisation[billingIndex].emails.toLocaleString('ru') }}
												</span> писем в месяц
											</div>
										</template>
										<template v-else>
											<a href="#" class="open-chat" v-on:click.prevent>Связаться с нами в чате</a>
										</template>
									</div>
									<b-button :href="'/panel/register/?cq_event=clickedOnStartTrial&cq_event_plan=busineschat&cq_event_traffic=' + billing[billingIndex].number" variant="primary" class="font14px w-100">
										Выбрать этот тариф
									</b-button>
									<a href="#" class="show d-md-none mt-4" v-on:click="showMoreAutomatization=!showMoreAutomatization">
										Подробнее
									</a>
									<b-row class="d-md-flex mt-4" :class="{ 'd-none' : !showMoreAutomatization }">
										<b-col class="font14px text">
											<p>
												<b>
													Основные особенности:
												</b>
											</p>
										</b-col>
									</b-row>
								</b-col>
								<b-col cols="12" lg="4" class="premium">
									<div class="calc__top">
										<g-image src="@/assets/images/components/small-47.png" fit="contain" background="transparent" position="left"  height="66" alt="premium" />
										<div class="h5 my-3">
											Премиум
										</div>
										<div class="calc__rate__description font14px grey-text">
											Получите экспертную поддержку наших специалистов по внедрению — они помогут вам настроить продвинутую коммуникацию
										</div>
									</div>
									<div class="calc__rate__price font20px">
										Индивидуальная цена
										<b>+7 (495) 105-91-69</b>
									</div>
									<b-button href="#" variant="outline-primary" v-on:click.prevent class="open-chat font14px">
										Связаться и обсудить проект
									</b-button>
									<a href="#" class="show d-md-none mt-4" v-on:click="showMorePremium=!showMorePremium">
										Подробнее
									</a>
									<div class="font14px d-md-block text mt-4" :class="{ 'd-none' : !showMorePremium }">
										<ul>
											<li>
												К вашему проекту подключится эксперт по сбору лидов
											</li>
											<li>
												Персональная поддержка в интеграции сервиса
											</li>
											<li>
												Персональное обучение работе с сервисом для вашей команды
											</li>
											<li>
												Ежемесячный разбор результатов и рекомендации от эксперта
											</li>
										</ul>
										<p>
											Запустили более 450 проектов автоматизации маркетинга
										</p>
									</div>
								</b-col>
							</b-row>
						</div>
					</b-col>
				</b-row>
			</b-container>
		</div>

		<!-- Дополнительные модули -->
		<section class="extention text">
			<b-container>
				<b-row>
					<div class="col-12">
						<h2 class="mb-4 mb-lg-5">
							Дополнительные модули
						</h2>
					</div>
				</b-row>
				<b-row>
					<b-col md="6" lg="4" class="mb-4 mb-md-5">
						<div class="extention__box h-100 font14px">
							<div class="d-flex align-items-center mb-3">
								<g-image src="@/assets/images/components/small-2.png" fit="contain" background="transparent" alt="Чат-боты" width="150" height="120" class="mr-3" />
								<h5>
									Лид-бот
								</h5>
							</div>
							<p>
								Собирайте больше квалифицированных лидов с сайта 24/7 без дополнительной нагрузки на ваших сотрудников.
								<g-link to="/chatbot/" target="_blank">Подробнее</g-link>
							</p>
							<div class="price">
								<div class="font20px">
									<b>2 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/subscription" class="btn">Подключить</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4" class="mb-4 mb-md-5">
						<div class="extention__box h-100 font14px">
							<div class="d-flex align-items-center mb-3">
								<g-image src="@/assets/images/components/small-20.png" fit="contain" background="transparent" alt="Конструктор писем"  width="150" height="120" class="mr-3" />
								<h5>
									Конструктор писем
								</h5>
							</div>
							<p>
								Визуальный конструктор писем, чтобы быстро создавать рассылки.
								<a data-fancybox href="https://www.youtube.com/watch?v=d7qvOIjIJ2U">Подробнее</a>
							</p>
							<div class="price">
								<div class="font20px">
									<b>1 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/subscription" class="btn">Попробовать бесплатно</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4" class="mb-4 mb-md-5">
						<div class="extention__box h-100 font14px">
							<div class="d-flex align-items-center mb-3">
								<g-image src="@/assets/images/components/small-23.png" fit="contain" background="transparent" position="top" alt="Статистика диалогов и операторов"  width="150" height="120" class="mr-3" />
								<h5>
									Статистика диалогов и операторов
								</h5>
							</div>
							<p>
								Когда надо оптимизировать работу операторов, используйте данные для принятия решений: Анализ загрузки операторов, скорость работы команды, статистика запросов, распределение диалогов по времени и т.д.
								<g-link to="/blog/metriki-tekhpodderzhki/" target="_blank" rel="noopener">Подробнее</g-link>
							</p>
							<div class="price">
								<div class="font20px">
									<b>1 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/conversations/statistics" class="btn">Попробовать бесплатно</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4" class="mb-4 mb-md-5 mb-lg-0">
						<div class="extention__box h-100 font14px">
							<div class="d-flex align-items-center mb-3">
								<g-image src="@/assets/images/components/small-6.png" fit="contain" background="transparent" alt="База знаний Pro"  width="150" height="120" class="mr-3" />
								<h5>
									База знаний Pro
								</h5>
							</div>
							<ul>
								<li>Неограниченное количество статей</li>
								<li>Скрытие статей от поисковых систем</li>
								<li>Возможность добавить счётчики Google Analytics и Яндекс.Метрики</li>
								<li>Возможность отключить « работает на Carrot quest »</li>
							</ul>
							<g-link to="/knowledge-base/" target="_blank" rel="noopener">Подробнее</g-link>
							<div class="price">
								<div class="font20px">
									<b>2 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/knowledge-base/" class="btn">Подключить</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4" class="mb-4 mb-md-5 mb-lg-0">
						<div class="extention__box h-100 font14px">
							<div class="d-flex align-items-center mb-3">
								<g-image src="@/assets/images/components/small-46.png" fit="contain" background="transparent" position="top" alt="Отключение бренда Carrot quest"  width="150" height="120" class="mr-3" />
								<h5>
									Отключение бренда Carrot quest
								</h5>
							</div>
							<ul>
								<li>Брендирование чата без упоминания Carrot quest</li>
								<li>Брендирование писем без упоминания Carrot quest</li>
							</ul>
							<div class="price">
								<div class="font20px">
									<b>1 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/subscription" class="btn">Попробовать бесплатно</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4">
						<div class="extention__box h-100 font14px">
							<div class="d-flex align-items-center mb-3">
								<g-image src="@/assets/images/components/small-4.png" fit="contain" background="transparent" position="top" alt="Дополнительный пакет писем"  width="150" height="120" class="mr-3" />
								<h5>
									Дополнительный пакет из 1 000 писем
								</h5>
							</div>
							<p>
								Если вы активно используете рассылки и отправляете больше писем, чем предусмотрено тарифом, то объем рассылки будет
								увеличен автоматически по цене 50 ₽ за каждую тысячу отправленных писем.
							</p>
							<div class="price">
								<div class="font20px">
									<b>50 ₽ </b>за 1000 писем
								</div>
							</div>
						</div>
					</b-col>
				</b-row>
			</b-container>
		</section>

		<Contacts 
			title="Не знаете какой тариф выбрать? Свяжитесь с нами"
			bg="#FFF3E6"
			consultation
		/>

		<!-- Все возможности сервиса -->
		<section class="all_features">
			<b-container>
				<b-row>
					<b-col>
						<h2 class="h1 mb-4 mb-lg-5">
							Все возможности сервиса
						</h2>
					</b-col>
				</b-row>
				<b-row class="text">
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Поддержка пользователей</b>
						</p>
						<ul class="font14px">
							<li>Онлайн-консультант</li>
							<li>Двухсторонняя интеграция с почтой</li>
							<li>История диалогов для пользователя и операторов</li>
							<li>Мобильные приложения iOS и Android для операторов</li>
							<li>Сохраненные ответы</li>
							<li>Каналы с автоматическим распределением диалогов</li>
							<li>Группы операторов для распределения нагрузки</li>
							<li>Назначение и откладывание диалогов</li>
							<li>Заметки, отправка файлов, эмоджи</li>
							<li>Оценка работы оператора пользователем</li>
							<li>Рабочие часы и уведомления операторам</li>
							<li>Блокировка пользователя</li>
							<li>Отправлять транскрипт переписки на емейл</li>
							<li>База знаний, интегрированная с чатом</li>
							<li>SDK для ваших мобильных приложений</li>
							<li>Аналитика по операторам и диалогам</li>
							<li>Скрытие чата</li>
							<li>Статистика по тегам диалогов</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Работа с лидами</b>
						</p>
						<ul class="font14px">
							<li>Трекинг всех данных о посетителях и пользователях</li>
							<li>eCRM с сегментацией базы лидов</li>
							<li>Персональная карточка каждого пользователя</li>
							<li>Теги пользователей</li>
							<li>Импорт пользователей</li>
							<li>Экспорт пользователей</li>
							<li>Склеивание лидов</li>
							<li>Массовые email-рассылки по сегментам пользователей</li>
							<li>Отложенные email-рассылки</li>
							<li>Аналитика рассылок</li>
							<li>Live-режим с данными о тех, кто сейчас на сайте</li>
							<li>Сбор данных о пользователях без помощи программиста</li>
							<li>JS API, Web API, WebHook API для передачи данных</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Лидогенерация и автоматизация воронки</b>
						</p>
						<ul class="font14px">
							<li>Welcome-сценарии</li>
							<li>Сценарии для сбора лидов с помощью поп-ап окон и чата</li>
							<li>Сценарии удержания пользователей с помощью емейлов</li>
							<li>Конструктор поп-апов</li>
							<li>Конструктор писем</li>
							<li>А/Б тесты и контрольные группы</li>
							<li>Постановка целей для сценариев</li>
							<li>Аналитика сценариев с хронологией изменений</li>
							<li>Коллекция готовых дизайнов для писем, поп-апов и сообщений в чат</li>
							<li>Воронки для анализа сайта и эффективности автоматизации</li>
							<li>Персональный домен для рассылок</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3">
						<p>
							<b>Дополнительно</b>
						</p>
						<ul class="font14px">
							<li>Дашборд и письма с основными метриками вашего сайта</li>
							<li>Разные права доступа для ваших сотрудников</li>
							<li>30+ готовых интеграций</li>
							<li>Дружелюбная поддержка</li>
							<li>База знаний</li>
							<li>Оплата любым удобным способом</li>
						</ul>
					</b-col>
				</b-row>
			</b-container>
		</section>

		<FAQ
			title="Часто задаваемые вопросы"
		   	:items="this.faq"
		/>

		<Consultation 
			title="Запишитесь на бесплатную демонстрацию сервиса" 
			text="Мы познакомимся, определим ваши задачи, за 30 минут обучим продукту и&nbsp;🎁&nbsp;бесплатно настроим базовый сценарий сбора лидов на вашем сайте"
			pic="medium-3.png"
			alt="Есть идеи!"
			bg="#fff3e6"
		/>

	</Layout>
</template>

<script>
	import Contacts 		from '~/components/Contacts.vue'
	import FAQ 				from '~/components/FAQ.vue'
	import Consultation 	from '~/components/Consultation.vue'
	import { BTooltip } 	from 'bootstrap-vue'

	export default {
		components: {
			Contacts,
			FAQ,
			Consultation,
			BTooltip
		},
		metaInfo() {
			return {
				script: [
					{ 
						type: 'application/ld+json', 
						json: {
							"@context": "https://schema.org",
							"@type": "FAQPage",
							"mainEntity": this.faq
						}
					}
				]
			}
		},
		data() {
			return {
				//Делаем в HEAD
				metaTitle: 'Тарифы | Стоимость сервиса Carrot quest. 20% скидки при оплате за год',
				metaDescription: 'Полный комплект сервисов по автоматизации маркетинга и коммуникаций с пользователями от 800 ₽ в месяц',
				metaCanonical: 'https://www.carrotquest.io/price/',
				metaImage: 'https://www.carrotquest.io/assets/images/cover/price.png',

				//Калькулятор
				ratio:  [ 1 , 0.9 , 0.85 , 0.8 ],
				ratioIndex: 3,
				billing: [
					1000,
					10000,
					30000,
					60000,
					100000,
					150000,
					200000,
					300000,
					400000,
					500000,
					700000,
					900000,
					1000000,
					1500000,
					2000000,
					2500000,
					0
				],
				buisness: [
					{ emails: 250, 		price: 1000 	},
					{ emails: 1250, 	price: 2100 	},
					{ emails: 5000, 	price: 4200 	},
					{ emails: 7500, 	price: 7000 	},
					{ emails: 10000, 	price: 10500 	},
					{ emails: 15000, 	price: 14000 	},
					{ emails: 20000, 	price: 18200 	},
					{ emails: 25000, 	price: 25200 	},
					{ emails: 30000, 	price: 33600 	},
					{ emails: 40000, 	price: 38500 	},
					{ emails: 50000, 	price: 49000 	},
					{ emails: 60000, 	price: 63000 	},
					{ emails: 70000, 	price: 70000 	},
					{ emails: 95000, 	price: 105000 	},
					{ emails: 125000, 	price: 140000 	},
					{ emails: 160000, 	price: 175000 	},
					{ emails: 0, 		price: 0 		}
				],
				automatisation: [
					{ emails: 500, 		price: 1500 	},
					{ emails: 2500, 	price: 4500 	},
					{ emails: 10000, 	price: 9000 	},
					{ emails: 15000, 	price: 15000 	},
					{ emails: 20000, 	price: 22500 	},
					{ emails: 30000, 	price: 30000 	},
					{ emails: 40000, 	price: 39000 	},
					{ emails: 50000, 	price: 54000 	},
					{ emails: 60000, 	price: 72000 	},
					{ emails: 80000, 	price: 82500 	},
					{ emails: 100000, 	price: 105000 	},
					{ emails: 120000, 	price: 135000 	},
					{ emails: 140000, 	price: 150000 	},
					{ emails: 190000, 	price: 225000 	},
					{ emails: 250000, 	price: 300000 	},
					{ emails: 320000, 	price: 375000 	},
					{ emails: 0, 		price: 0 		}
				],
				billingIndex: 1,
				showMoreAutomatization: false,
				showMorePremium: false,

				//FAQ
				faq: [
					{
						'@type': "Question",
						name: 'Чем отличаются тарифы? Какой мне подойдёт? ',
						acceptedAnswer: {
							'@type': 'Answer',
							text: '<p> Стоимость тарифа зависит от трафика на вашем сайте. В зависимости от тарифа вам предоставляется квота писем, которые вы можете отправлять через сервис. Функциональные возможности Carrot quest одинаковы для всех тарифов. </p> <p> Вы можете дополнить инструменты тарифа, подключив дополнительные модули. </p>'
						}
					},
					{
						'@type': "Question",
						name: 'Я не планирую пользоваться всеми инструментами. Можно подключить только чат? ',
						acceptedAnswer: {
							'@type': 'Answer',
							text: '<p> Нет, Carrot quest — это комплексный инструмент, и мы верим, что вы получаете максимальную пользу, используя весь набор инструментов. Если вам нужна консультация по инструментам, напишите нам в чат, мы подскажем. </p>'
						}
					},
					{
						'@type': "Question",
						name: 'Как считаются уникальные пользователи? ',
						acceptedAnswer: {
							'@type': 'Answer',
							text: '<p> Уникальный посетитель — это посетитель сайта либо загруженный пользователь с определенным набором параметров: cookies, браузер, ОС и другие свойства или события. Если один и тот же человек зашел один раз вчера и два раза сегодня — это все равно один уникальный посетитель. </p> <p> <a href=https://help.carrotquest.io/article/217>Подробнее</a> о подсчёте уникальных посетителей. </p>'
						}
					},
					{
						'@type': "Question",
						name: 'Сколько писем можно отправить на каждом тарифе? ',
						acceptedAnswer: {
							'@type': 'Answer',
							text: '<p>В каждый тариф включена квота писем, которые вы можете рассылать:</p> <ul> <li>1000 уникальных посетителей = 500 писем в месяц</li> <li>10 000 уникальных посетителей = 2500 писем в месяц</li> <li>30 000 уникальных посетителей = 10 000 писем в месяц</li> <li>60 000 уникальных посетителей = 15 000 писем в месяц</li> <li>100 000 уникальных посетителей = 20 000 писем в месяц</li> <li>150 000 уникальных посетителей = 30 000 писем в месяц</li> <li>200 000 уникальных посетителей = 40 000 писем в месяц</li> <li>300 000 уникальных посетителей = 50 000 писем в месяц</li> </ul> <p> Если вы превысите квоту, то за каждую следующую 1000 писем вы заплатите 50 рублей. </p>'
						}
					},
					{
						'@type': "Question",
						name: 'Что если у меня несколько сайтов? ',
						acceptedAnswer: {
							'@type': 'Answer',
							text: '<p> Вы можете подключить все свои сайты к одному аккаунту. К каждому сайту будет отдельный доступ и группа операторов/администраторов. Каждый сайт оплачивается отдельно. </p> <p> Если сайты находятся в рамках одного домена, рекомендуем на каждый из них разместить один и тот же код сервиса, тогда оплата будет как за один сайт. </p>'
						}
					},
					{
						'@type': "Question",
						name: 'Что произойдёт, если я превышу квоты по тарифу? ',
						acceptedAnswer: {
							'@type': 'Answer',
							text: '<p> Работа сервиса не остановится. Мы пришлём вам счет на перерасход, который считается пропорционально вашему тарифу, или предложим перейти на новый тариф. </p> <p> Мы всегда отталкиваемся от более выгодного для вас варианта. </p>'
						}
					},
					{
						'@type': "Question",
						name: 'Как можно оплатить сервис? ',
						acceptedAnswer: {
							'@type': 'Answer',
							text: '<ul> <li> По карте Visa, Mastercard<br> <span> Если вы оплатили сервис картой, подключается автоплатёж, и деньги автоматически спишутся в конце оплаченного периода. Так вы не пропустите случайно срок оплаты и не останетесь без инструментов сервиса.</span> </li> <li>Через электронный кошелёк</li> <li>Оплата через банк</li> <li>По безналичному расчету</li> </ul>'
						}
					}
				]
			}
		}
	}	
</script>

<style lang="scss">
	@import "~/assets/scss/base.scss";
	@import "~bootstrap/scss/tooltip";
	@import "~bootstrap-vue/src/components/tooltip/index";
	.page-price {
		.calculate {
			background-color: #F3F3FF;
			.calc {
				&__select {
					padding: 1.5rem 1.25rem 1.5rem 0;
					&__time {
						.custom-control-label {
							line-height: 32px;
							&:hover{
								cursor: pointer;
							}
							&::before , &::after {
								margin-top:3px;
							}
						}
						span {
							display: inline-block;
							font-size: 12px;
							background: no-repeat right url("data:image/svg+xml,%3Csvg width='92' height='34' viewBox='0 0 92 34' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cg filter='url(%23filter0_d)'%3E%3Cpath fill-rule='evenodd' clip-rule='evenodd' d='M13.6416 6.42925L6.50004 13.4292C4.49999 15.3896 4.49999 18.6104 6.50004 20.5708L13.6416 27.5708C14.5763 28.4869 15.8328 29 17.1416 29H81.9996C84.7611 29 86.9996 26.7614 86.9996 24V10C86.9996 7.23858 84.7611 5 81.9996 5H17.1416C15.8328 5 14.5763 5.51314 13.6416 6.42925ZM10.8571 19C11.9616 19 12.8571 18.1046 12.8571 17C12.8571 15.8954 11.9616 15 10.8571 15C9.75249 15 8.85706 15.8954 8.85706 17C8.85706 18.1046 9.75249 19 10.8571 19Z' fill='%23FBFBFB'/%3E%3C/g%3E%3Cdefs%3E%3Cfilter id='filter0_d' x='0' y='0' width='91.9996' height='34' filterUnits='userSpaceOnUse' color-interpolation-filters='sRGB'%3E%3CfeFlood flood-opacity='0' result='BackgroundImageFix'/%3E%3CfeColorMatrix in='SourceAlpha' type='matrix' values='0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0'/%3E%3CfeOffset/%3E%3CfeGaussianBlur stdDeviation='2.5'/%3E%3CfeColorMatrix type='matrix' values='0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.1 0'/%3E%3CfeBlend mode='normal' in2='BackgroundImageFix' result='effect1_dropShadow'/%3E%3CfeBlend mode='normal' in='SourceGraphic' in2='effect1_dropShadow' result='shape'/%3E%3C/filter%3E%3C/defs%3E%3C/svg%3E%0A");
							padding: 0 8px 0 16px;
						}
						.year span {
							background: no-repeat right url("data:image/svg+xml,%3Csvg width='82' height='24' viewBox='0 0 82 24' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath fill-rule='evenodd' clip-rule='evenodd' d='M8.64162 1.42925L1.50004 8.42925C-0.500013 10.3896 -0.500013 13.6104 1.50004 15.5708L8.64162 22.5708C9.57627 23.4869 10.8328 24 12.1416 24H76.9996C79.7611 24 81.9996 21.7614 81.9996 19V5C81.9996 2.23858 79.7611 0 76.9996 0H12.1416C10.8328 0 9.57626 0.513136 8.64162 1.42925ZM5.85706 14C6.96163 14 7.85706 13.1046 7.85706 12C7.85706 10.8954 6.96163 10 5.85706 10C4.75249 10 3.85706 10.8954 3.85706 12C3.85706 13.1046 4.75249 14 5.85706 14Z' fill='%23FF6600'/%3E%3C/svg%3E%0A");
							padding: 0 4px 0 18px;
							color: #fff;
						}
					}
					&__mobile {
						font-size: 18px;
						border: 1px solid #D5DDF3;
						border-radius: 5px;
					}
				}
				&__rate {
					.row__box {
						background-color: #fff;
						border-radius: 5px;
						box-shadow: 0px 3px 10px rgba(0, 0, 0, 0.1);
						padding-top: 1.5rem;
						padding-bottom: 1.5rem;
					}
					&__price {
						height: 50px;
						margin-bottom: 1rem; 
					}
					#price_before_sale {
						position: relative;
						margin-right: 8px;
						&::before {
							content: "";
							display: block;
							width: 120%;
							height: 1px;
							border-bottom: 1px solid #FF0000;
							transform: rotate(-8deg);
							position: absolute;
							top: 13px;
							left: -10%;
						}
					}
					.automatization::before , .premium::before {
						content: " ";
						display: block;
						position: absolute;
						left: 0;
						top: -24px;
						bottom: -24px;
						width: 1px;
						background-color: #E8E8E8;
					}
					.show {
						text-decoration: none;
						border-bottom: 1px dashed #FF7C16;
						position: relative;
						display: inline-block;
						&::after {
							content: " ";
							display: block;
							position: absolute;
							right: -16px;
							top: 10px;
							width: 10px;
							height: 6px;
							background-image: url("data:image/svg+xml,%3Csvg width='10' height='6' viewBox='0 0 10 6' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath d='M1 1L5 5L9 1' stroke='%23FF6600'/%3E%3C/svg%3E%0A");
						}
					}
					.btn-text {
						padding: 0;
						text-align: left;
						span {
							border-bottom: 1px dashed #9b9b9b;
							&:hover {
								border-bottom: 1px dashed #fff;
							}
						}
					}
				}
				@media (max-width: 575.98px) {
					&__select {
						padding: 0;
					}
				}
				@media (max-width: 991.98px) {
					&__rate {
						.row__box {
							background-color: transparent;
							box-shadow: none;

							&>.col-12 {
								box-shadow: 0px 3px 10px rgba(0, 0, 0, 0.1);
								background-color: #fff;
								padding: 24px 20px;
								border-radius: 5px;
								margin-bottom: 2rem;
								&::before {
									display: none;
								}
								.calc__top {
									height: auto;
									margin-bottom: 1rem;
								}
							}
						}
						.row:first-child {
							padding-top: 0;
							padding-bottom: 0;
						}
					}
				}
				@media (max-width: 1199.98px) {
					&__select {
						&__lids {
							margin-top: 16px;
							br {
								display: none;
							}
						}
					}
					&__rate {
						margin-top: 32px;
						padding-left: 20px;
						padding-right: 20px;
						.calc__top {
							height: 220px;
						}
					}
				}
				@media (min-width: 1200px) {
					&__top {
						height: 220px;
					}
					&__select {
						width: 310px;
						float: left;
					}
					&__rate {
						float: right;
						width: 770px;
					}
				}
			}
		}

		.extention {
			@media (min-width: 768px) {
				.mb-md-5 {
					margin-bottom: 2.5rem !important;
				}
				.mb-lg-0 {
					margin-bottom: 0 !important;
				}
			}
			&__box {
				box-shadow: 0px 3px 10px rgba(0, 0, 0, 0.1);
				border-radius: 5px;
				padding: 20px 20px 110px;
				position: relative;
				img {
					width: 75px;
				}
				.price {
					position: absolute;
					bottom: 1.5rem;
					overflow: hidden;
					font-family: 'PT Sans', sans-serif !important;
					a {
						margin: 0.5rem 0 0;
						display: inline-block;
					}
					.btn {
						color: #000;
						border: 1px solid #FF6600;
						border-radius: 5px;
						padding: 0.5rem 1.5rem 0.4rem;
						display: table;
						background: #fff;
						transition: all 150ms cubic-bezier(0, 0, 0.2, 1);
						&:hover {
							color: #fff;
							background: #FF6600;
						}
					}
				}
				.price_without_button {
					padding-bottom: 58px;
				}
			}
		}

		.all_features {
			ul {
				margin-bottom: 2rem;
				li {
					border-bottom: 1px solid #E8E8E8;
					padding-bottom: 0.5rem;
				}
			}
		}

		.calculate , .extention , .all_features {
			ul {
				li {
					&:last-child {
						border-bottom: 0;
					}
					&::before {
						content: "";
						width: 9px;
						height: 5px;
						border: 1px solid #333;
						background-color: transparent;
						border-top: none;
						border-right: none;
						transform: rotate(-45deg);
						margin-top: 0.5rem;
					}
				}
			}
		}
	}
</style>
