<template>
	<Layout class="page">
		<div class="blue">
			<b-container>
			
				<b-row class="hero">
					
				</b-row>
				
				<b-row class="features">
					<MegaTabs 
						title="Улучшайте метрики вашего продукта: конверсия сайта, больше ретеншн, меньше отток клиентов"
						:tabs="[
							{
								title: 'Вы увеличите число квалифицированных лидов с сайта с помощью поп-апов и чат-бота',
								pic: 'https://www.carrotquest.io/blog/article/assets/video/components/MegaTabs/1.mp4'
							},
							{
								title: 'Больше пользователей поймут ваш сервис и вернутся к использованию. С помощью емейл-сценариев, поп-ап окошек и бизнес-чата',
								pic: '2.png'
							},
							{
								title: 'Пользователи дольше останутся в сервисе, если работать с оттоком. С помощью триггерных сценариев и персональной поддержки',
								pic: '3.png'
							}
						]"
						:more="{
							text: 'Узнать подробнее как',
							href: '/'
						}"
						:instruments="[
							{
								title: '<i>Автоматический трекинг</i> данных о пользователях с сегментацией',
								pic: 'small-1.png',
								href: '/automation-marketing'
							},
							{
								title: '<i>Лид-бот</i> на сайте для генерации и квалификации лидов',
								pic: 'small-2.png',
								href: '/chatbot/'
							},
							{
								title: '<i>Pop-up окна</i>, работающие на основе поведения пользователей',
								pic: 'small-3.png',
								href: '/pop-up/'
							},
							{
								title: '<i>Триггерные емейл кампании</i> для удержания и возвращения клиентов',
								pic: 'small-4.png',
								href: '/email-marketing/'
							}
						]"
					/>


					<MegaTabs 
						title="Помогите клиенту пользоваться вашим продуктом с минимальными нагрузками на команду поддержки"
						:tabs="[
							{
								title: '90% людей предпочитают писать. Объедините каналы общения в один простой интерфес для клиента и менеджера поддержки',
								pic: '4.png'
							},
							{
								title: 'Снимайте 80% стандартных вопросов с поддержки с помощью базы знаний, быстрых ответов и чат-бота',
								pic: '5.png'
							},
							{
								title: '30% сложных вопросов решается проще, если менеджер знает о клиенте всё благодаря подробному профилю клиента',
								pic: '6.png'
							}
						]"
						:instruments="[
							{
								title: '<i>Бизнес-чат</i> с персонализацией и аудио/видео звонками для лучшей поддержки клиентов',
								pic: 'small-5.png',
								href: '/online-consultant/'
							},
							{
								title: '<i>База знаний</i> для самообслуживания клиентов и ускорения работы менеджеров',
								pic: 'small-6.png',
								href: '/knowledge-base/'
							},
							{
								title: '<i>Каналы диалогов</i> для распределения диалогов по командам и менеджерам',
								pic: 'small-7.png',
								href: '/online-consultant/'
							},
							{
								title: '<i>База пользователей</i> со всеми данными о них в одном сервисе и интеграциями',
								pic: 'small-8.png',
								href: '/lead-manager'
							}
						]"
					/>


					<MegaTabs 
						title="Понимайте своего клиента и находите инсайты для улучшения продукта"
						:tabs="[
							{
								title: 'Клиенты готовы рассказать вам о багах и своих задачах. Дайте им такую возможность — объедините чат, месенджеры, соцсети, почту.',
								pic: '7.png'
							},
							{
								title: 'Собирайте инсайты о том, как клиенты используют ваш продукт. Это помогает его развивать в нужном направлении.',
								pic: '8.png'
							},
							{
								title: 'Находите узкие места и улучшайте продукт. С помощью воронок сайта и подробного пути пользователя.',
								pic: '9.png'
							}
						]"
						:instruments="[
							{
								title: '<i>Бизнес-чат</i> в котором пользователи рассказывают о багах и фиче реквестах',
								pic: 'small-5.png',
								href: '/online-consultant/'
							},
							{
								title: '<i>Карточка каждого пользователя</i> с подробными данными о нем и его действиях на сайте',
								pic: 'small-8.png',
								href: '/lead-manager'
							},
							{
								title: '<i>Трекинг данных</i>, воронки сайта, аналитика событий для поиска узких мест',
								pic: 'small-1.png',
								href: '/automation-marketing'
							},
							{
								title: '<i>Интеграции с сервисами</i> и вашей инфраструктурой, чтобы знать все о клиенте',
								pic: 'small-9.png',
								href: '/integration/'
							}
						]"
					/>

				</b-row>

			</b-container>
		</div>
	</Layout>
</template>

<script>
	import MegaTabs from '~/components/MegaTabs/MegaTabs.vue'

	export default {
		components: {
			MegaTabs
		},

		//Делаем в HEAD
		metaInfo() {
			return {
				title: 'Решение для SaaS-сервисов',
				meta: [
					{
						key: 'description',
						name: 'description',
						content: 'Повышаем продажи SaaS сервисов с помощью автоматизации маркетинга. Используйте инструменты аналитики и автосообщения для привлечения платящих клиентов в SaaS.'
					},
					{
						property: "og:image",
						content: 'https://www.carrotquest.io/img/cover.gif'
					},
				],
				link: [
					{
						rel: 'canonical',
						href: 'https://www.carrotquest.io/sass/'
					}
				]
			}
		},
	}	
</script>

<style lang="scss">
	.blue {
		background-color: #F7F7FC;
	}
</style>