<template>
	<Layout class="page page-price">

		<div class="hero">
			<b-container>
				<b-row>
					<b-col lg="8">
						<div class="h2 my-5">
							Мы&nbsp;помогаем онлайн-бизнесу общаться с&nbsp;клиентами и&nbsp;увеличивать их&nbsp;число
						</div>
					</b-col>
				</b-row>
			</b-container>
		</div>


		<section class="all_features">
			<b-container>
				<b-row>
					<b-col>
						<h2 class="h1 mb-4 mb-lg-5">
							Все возможности сервиса
						</h2>
					</b-col>
				</b-row>
				<b-row class="text">
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Поддержка пользователей</b>
						</p>
						<ul class="font14px">
							<li>Онлайн-консультант</li>
							<li>Двухсторонняя интеграция с&nbsp;почтой</li>
							<li>История диалогов для пользователя и&nbsp;операторов</li>
							<li>Мобильные приложения iOS и&nbsp;Android для операторов</li>
							<li>Сохраненные ответы</li>
							<li>Каналы с&nbsp;автоматическим распределением диалогов</li>
							<li>Группы операторов для распределения нагрузки</li>
							<li>Назначение и&nbsp;откладывание диалогов</li>
							<li>Заметки, отправка файлов, эмоджи</li>
							<li>Оценка работы оператора пользователем</li>
							<li>Рабочие часы и&nbsp;уведомления операторам</li>
							<li>Блокировка пользователя</li>
							<li>Отправлять транскрипт переписки на&nbsp;емейл</li>
							<li>База знаний, интегрированная с&nbsp;чатом</li>
							<li>SDK для ваших мобильных приложений</li>
							<li>Аналитика по&nbsp;операторам и&nbsp;диалогам</li>
							<li>Скрытие чата</li>
							<li>Статистика по&nbsp;тегам диалогов</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Работа с&nbsp;лидами</b>
						</p>
						<ul class="font14px">
							<li>Трекинг всех данных о&nbsp;посетителях и&nbsp;пользователях</li>
							<li>eCRM с&nbsp;сегментацией базы лидов</li>
							<li>Персональная карточка каждого пользователя</li>
							<li>Теги пользователей</li>
							<li>Импорт пользователей</li>
							<li>Экспорт пользователей</li>
							<li>Склеивание лидов</li>
							<li>Массовые email-рассылки по&nbsp;сегментам пользователей</li>
							<li>Отложенные email-рассылки</li>
							<li>Аналитика рассылок</li>
							<li>Live-режим с&nbsp;данными о&nbsp;тех, кто сейчас на&nbsp;сайте</li>
							<li>Сбор данных о&nbsp;пользователях без помощи программиста</li>
							<li>JS&nbsp;API, Web API, WebHook API для передачи данных</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Лидогенерация и&nbsp;автоматизация воронки</b>
						</p>
						<ul class="font14px">
							<li>Welcome-сценарии</li>
							<li>Сценарии для сбора лидов с&nbsp;помощью поп-ап окон и&nbsp;чата</li>
							<li>Сценарии удержания пользователей с&nbsp;помощью емейлов</li>
							<li>Конструктор поп-апов</li>
							<li>Конструктор писем</li>
							<li>А/Б тесты и&nbsp;контрольные группы</li>
							<li>Постановка целей для сценариев</li>
							<li>Аналитика сценариев с&nbsp;хронологией изменений</li>
							<li>Коллекция готовых дизайнов для писем, поп-апов и&nbsp;сообщений в&nbsp;чат</li>
							<li>Воронки для анализа сайта и&nbsp;эффективности автоматизации</li>
							<li>Персональный домен для рассылок</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3">
						<p>
							<b>Дополнительно</b>
						</p>
						<ul class="font14px">
							<li>Дашборд и&nbsp;письма с&nbsp;основными метриками вашего сайта</li>
							<li>Разные права доступа для ваших сотрудников</li>
							<li>30+&nbsp;готовых интеграций</li>
							<li>Дружелюбная поддержка</li>
							<li>База знаний</li>
							<li>Оплата любым удобным способом</li>
						</ul>
					</b-col>
				</b-row>
			</b-container>
		</section>

		<FAQ 
			title="Часто задаваемые вопросы"
			:items="[
				{
					question: 'Чем отличаются тарифы? Какой мне подойдёт?',
					answer: '<p> Стоимость тарифа зависит от трафика на вашем сайте. В зависимости от тарифа вам предоставляется квота писем, которые вы можете отправлять через сервис. Функциональные возможности Carrot quest одинаковы для всех тарифов. </p> <p> Вы можете дополнить инструменты тарифа, подключив дополнительные модули. </p>'
				},
				{
					question: 'Я не планирую пользоваться всеми инструментами. Можно подключить только чат?',
					answer: '<p> Нет, Carrot quest — это комплексный инструмент, и мы верим, что вы получаете максимальную пользу, используя весь набор инструментов. Если вам нужна консультация по инструментам, напишите нам в чат, мы подскажем. </p>'
				},
				{
					question: 'Как считаются уникальные пользователи?',
					answer: '<p> Уникальный посетитель — это посетитель сайта либо загруженный пользователь с определенным набором параметров: cookies, браузер, ОС и другие свойства или события. Если один и тот же человек зашел один раз вчера и два раза сегодня — это все равно один уникальный посетитель. </p> <p> <a href=https://help.carrotquest.io/article/217>Подробнее</a> о подсчёте уникальных посетителей. </p>'
				},
				{
					question: 'Сколько писем можно отправить на каждом тарифе?',
					answer: '<p>В каждый тариф включена квота писем, которые вы можете рассылать:</p> <ul> <li>1000 уникальных посетителей = 500 писем в месяц</li> <li>10 000 уникальных посетителей = 2500 писем в месяц</li> <li>30 000 уникальных посетителей = 10 000 писем в месяц</li> <li>60 000 уникальных посетителей = 15 000 писем в месяц</li> <li>100 000 уникальных посетителей = 20 000 писем в месяц</li> <li>150 000 уникальных посетителей = 30 000 писем в месяц</li> <li>200 000 уникальных посетителей = 40 000 писем в месяц</li> <li>300 000 уникальных посетителей = 50 000 писем в месяц</li> </ul> <p> Если вы превысите квоту, то за каждую следующую 1000 писем вы заплатите 50 рублей. </p>'
				},
				{
					question: 'Что если у меня несколько сайтов?',
					answer: '<p> Вы можете подключить все свои сайты к одному аккаунту. К каждому сайту будет отдельный доступ и группа операторов/администраторов. Каждый сайт оплачивается отдельно. </p> <p> Если сайты находятся в рамках одного домена, рекомендуем на каждый из них разместить один и тот же код сервиса, тогда оплата будет как за один сайт. </p>'
				},
				{
					question: 'Что произойдёт, если я превышу квоты по тарифу?',
					answer: '<p> Работа сервиса не остановится. Мы пришлём вам счет на перерасход, который считается пропорционально вашему тарифу, или предложим перейти на новый тариф. </p> <p> Мы всегда отталкиваемся от более выгодного для вас варианта. </p>'
				},
				{
					question: 'Как можно оплатить сервис?',
					answer: '<ul> <li> По карте Visa, Mastecard<br> <span> Если вы оплатили сервис картой, подключается автоплатёж, и деньги автоматически спишутся в конце оплаченного периода. Так вы не пропустите случайно срок оплаты и не останетесь без инструментов. сервиса </span> </li> <li>Через электронный кошелёк</li> <li>Оплата через банк</li> <li>По безналичному расчету</li> </ul>'
				}
			]"
		/>

		<Consultation 
			title="Запишитесь на бесплатную демонстрацию сервиса" 
			text="Мы познакомимся, определим ваши задачи, за 30 минут обучим продукту и&nbsp;🎁&nbsp;бесплатно настроим базовый сценарий сбора лидов на вашем сайте"
			pic="medium-2.png"
			alt="Девочка, живущая в сети"
			bg="#fff3e6"
		/>

	</Layout>
</template>

<script>
	import FAQ 				from '~/components/FAQ.vue'
	import Consultation 	from '~/components/Consultation.vue'

	export default {
		components: {
			FAQ,
			Consultation
		},
		data() {
			return {
				//Делаем в HEAD
				metaTitle: 'Тарифы | Стоимость сервиса Carrot quest. 20% скидки при оплате за год',
				metaDescription: 'Полный комплект сервисов по автоматизации маркетинга и коммуникаций с пользователями от 800 ₽ в месяц',
				metaCanonical: 'https://www.carrotquest.io/price/',
				metaImage: 'https://www.carrotquest.io/assets/images/cover/price.png',
			}
		}
	}	
</script>


<style lang="scss">
	.page-price {
		.hero {
			background-color: #F3F3FF;
		}

		.all_features {
			ul {
				margin-bottom: 2rem;
				li {
					border-bottom: 1px solid #E8E8E8;
					padding-bottom: 0.5rem;
					&:last-child {
						border-bottom: 0;
					}
				}
			}
		}

	}
</style>