<template>
	<Layout class="page page-price">

		<div class="hero">
			<b-container>
				<b-row>
					<b-col lg="8">
						<div class="h2 my-5">
							Мы&nbsp;помогаем онлайн-бизнесу общаться с&nbsp;клиентами и&nbsp;увеличивать их&nbsp;число
						</div>
					</b-col>
				</b-row>
			</b-container>
		</div>

		<!-- Дополнительные модули -->
		<section class="extention">
			<b-container>
				<b-row>
					<div class="col-12">
						<h2 class="mb-4 mb-lg-5">
							Дополнительные модули
						</h2>
					</div>
				</b-row>
				<b-row>
					<b-col md="6" lg="4">
						<div class="extention__box">
							<div class="d-flex align-items-center">
								<g-image src="@/assets/images/components/small-2.png" alt="Чат-боты" width="74" height="60" />
								<h4>
									Лид-бот
								</h4>
							</div>
							<p>
								Собирайте больше квалифицированных лидов с сайта 24/7 без дополнительной нагрузки на ваших сотрудников.
								<g-link to="/chatbot/" target="_blank">Подробнее</g-link>
							</p>
							<div class="price">
								<div class="f20">
									<b>2 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/subscription" class="btn">Подключить</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4">
						<div class="extention__box">
							<div class="d-flex align-items-center">
								<g-image src="@/assets/images/components/small-20.png" alt="Конструктор писем" width="74" height="60" />
								<h4>
									Конструктор писем
								</h4>
							</div>
							<p>
								Визуальный конструктор писем, чтобы быстро создавать рассылки.
								<a data-fancybox href="https://www.youtube.com/watch?v=d7qvOIjIJ2U">Подробнее</a>
							</p>
							<div class="price">
								<div class="f20">
									<b>1 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/subscription" class="btn">Попробовать бесплатно</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4">
						<div class="extention__box">
							<div class="d-flex align-items-center">
								<g-image src="@/assets/images/components/small-23.png" alt="Статистика диалогов и операторов" width="74" height="60" />
								<h4>
									Статистика диалогов и операторов
								</h4>
							</div>
							<p>
								Когда надо оптимизировать работу операторов, используйте данные для принятия решений: Анализ загрузки операторов, скорость работы команды, статистика запросов, распределение диалогов по времени и т.д.
								<a href="/blog/zhiznenno-vazhnye-metriki-sluzhby-podderzhki-kotorye-stoit-nachat-izmeryat-uzhe-segodnya/" target="_blank" rel="noopener">Подробнее</a>
							</p>
							<div class="price">
								<div class="f20">
									<b>1 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/conversations/statistics" class="btn">Попробовать бесплатно</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4">
						<div class="extention__box">
							<div class="d-flex align-items-center">
								<g-image src="@/assets/images/components/small-6.png" alt="База знаний Pro" width="74" height="60" />
								<h4>
									База знаний Pro
								</h4>
							</div>
							<ul>
								<li>Неограниченное количество статей</li>
								<li>Скрытие статей от поисковых систем</li>
								<li>Возможность добавить счётчики Google Analytics и Яндекс.Метрики</li>
								<li>Возможность отключить «работает на Carrot quest»</li>
							</ul>
							<g-link to="/knowledge-base/" target="_blank" rel="noopener">Подробнее</g-link>
							<div class="price">
								<div class="f20">
									<b>2 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/knowledge-base/" class="btn">Подключить</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4">
						<div class="extention__box">
							<div class="d-flex align-items-center">
								<g-image src="@/assets/images/components/small-46.png" alt="Отключение бренда Carrot quest" width="74" height="60" />
								<h4>
									Отключение бренда Carrot quest
								</h4>
							</div>
							<ul>
								<li>Брендирование чата без упоминания Carrot quest</li>
								<li>Брендирование писем без упоминания Carrot quest</li>
							</ul>
							<div class="price">
								<div class="f20">
									<b>1 000 ₽ </b>в месяц
								</div>
								<a href="/panel/toAPP/subscription" class="btn">Попробовать бесплатно</a>
							</div>
						</div>
					</b-col>
					<b-col md="6" lg="4">
						<div class="extention__box">
							<div class="d-flex align-items-center">
								<g-image src="@/assets/images/components/small-4.png" alt="Дополнительный пакет писем" width="74" height="60" />
								<h4>
									Дополнительный пакет из 1 000 писем
								</h4>
							</div>
							<p>
								Если вы активно используете рассылки и отправляете больше писем, чем предусмотрено тарифом, то объем рассылки будет 
								увеличен автоматически по цене 50 ₽ за каждую тысячу отправленных писем.
							</p>
							<div class="price">
								<div class="f20">
									<b>50 ₽ </b>за 1000 писем
								</div>
							</div>
						</div>
					</b-col>
				</b-row>
			</b-container>
		</section>

		<Contacts 
			title="Не знаете какой тариф выбрать? Свяжитесь с нами"
			bg="#FFEAD2"
			consultation
		/>

		<!-- Все возможности сервиса -->
		<section class="all_features">
			<b-container>
				<b-row>
					<b-col>
						<h2 class="h1 mb-4 mb-lg-5">
							Все возможности сервиса
						</h2>
					</b-col>
				</b-row>
				<b-row class="text">
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Поддержка пользователей</b>
						</p>
						<ul class="font14px">
							<li>Онлайн-консультант</li>
							<li>Двухсторонняя интеграция с&nbsp;почтой</li>
							<li>История диалогов для пользователя и&nbsp;операторов</li>
							<li>Мобильные приложения iOS и&nbsp;Android для операторов</li>
							<li>Сохраненные ответы</li>
							<li>Каналы с&nbsp;автоматическим распределением диалогов</li>
							<li>Группы операторов для распределения нагрузки</li>
							<li>Назначение и&nbsp;откладывание диалогов</li>
							<li>Заметки, отправка файлов, эмоджи</li>
							<li>Оценка работы оператора пользователем</li>
							<li>Рабочие часы и&nbsp;уведомления операторам</li>
							<li>Блокировка пользователя</li>
							<li>Отправлять транскрипт переписки на&nbsp;емейл</li>
							<li>База знаний, интегрированная с&nbsp;чатом</li>
							<li>SDK для ваших мобильных приложений</li>
							<li>Аналитика по&nbsp;операторам и&nbsp;диалогам</li>
							<li>Скрытие чата</li>
							<li>Статистика по&nbsp;тегам диалогов</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Работа с&nbsp;лидами</b>
						</p>
						<ul class="font14px">
							<li>Трекинг всех данных о&nbsp;посетителях и&nbsp;пользователях</li>
							<li>eCRM с&nbsp;сегментацией базы лидов</li>
							<li>Персональная карточка каждого пользователя</li>
							<li>Теги пользователей</li>
							<li>Импорт пользователей</li>
							<li>Экспорт пользователей</li>
							<li>Склеивание лидов</li>
							<li>Массовые email-рассылки по&nbsp;сегментам пользователей</li>
							<li>Отложенные email-рассылки</li>
							<li>Аналитика рассылок</li>
							<li>Live-режим с&nbsp;данными о&nbsp;тех, кто сейчас на&nbsp;сайте</li>
							<li>Сбор данных о&nbsp;пользователях без помощи программиста</li>
							<li>JS&nbsp;API, Web API, WebHook API для передачи данных</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3" class="mb-5 mb-xl-0">
						<p>
							<b>Лидогенерация и&nbsp;автоматизация воронки</b>
						</p>
						<ul class="font14px">
							<li>Welcome-сценарии</li>
							<li>Сценарии для сбора лидов с&nbsp;помощью поп-ап окон и&nbsp;чата</li>
							<li>Сценарии удержания пользователей с&nbsp;помощью емейлов</li>
							<li>Конструктор поп-апов</li>
							<li>Конструктор писем</li>
							<li>А/Б тесты и&nbsp;контрольные группы</li>
							<li>Постановка целей для сценариев</li>
							<li>Аналитика сценариев с&nbsp;хронологией изменений</li>
							<li>Коллекция готовых дизайнов для писем, поп-апов и&nbsp;сообщений в&nbsp;чат</li>
							<li>Воронки для анализа сайта и&nbsp;эффективности автоматизации</li>
							<li>Персональный домен для рассылок</li>
						</ul>
					</b-col>
					<b-col lg="6" xl="3">
						<p>
							<b>Дополнительно</b>
						</p>
						<ul class="font14px">
							<li>Дашборд и&nbsp;письма с&nbsp;основными метриками вашего сайта</li>
							<li>Разные права доступа для ваших сотрудников</li>
							<li>30+&nbsp;готовых интеграций</li>
							<li>Дружелюбная поддержка</li>
							<li>База знаний</li>
							<li>Оплата любым удобным способом</li>
						</ul>
					</b-col>
				</b-row>
			</b-container>
		</section>

		<FAQ 
			title="Часто задаваемые вопросы"
			:items="[
				{
					question: 'Чем отличаются тарифы? Какой мне подойдёт?',
					answer: '<p> Стоимость тарифа зависит от трафика на вашем сайте. В зависимости от тарифа вам предоставляется квота писем, которые вы можете отправлять через сервис. Функциональные возможности Carrot quest одинаковы для всех тарифов. </p> <p> Вы можете дополнить инструменты тарифа, подключив дополнительные модули. </p>'
				},
				{
					question: 'Я не планирую пользоваться всеми инструментами. Можно подключить только чат?',
					answer: '<p> Нет, Carrot quest — это комплексный инструмент, и мы верим, что вы получаете максимальную пользу, используя весь набор инструментов. Если вам нужна консультация по инструментам, напишите нам в чат, мы подскажем. </p>'
				},
				{
					question: 'Как считаются уникальные пользователи?',
					answer: '<p> Уникальный посетитель — это посетитель сайта либо загруженный пользователь с определенным набором параметров: cookies, браузер, ОС и другие свойства или события. Если один и тот же человек зашел один раз вчера и два раза сегодня — это все равно один уникальный посетитель. </p> <p> <a href=https://help.carrotquest.io/article/217>Подробнее</a> о подсчёте уникальных посетителей. </p>'
				},
				{
					question: 'Сколько писем можно отправить на каждом тарифе?',
					answer: '<p>В каждый тариф включена квота писем, которые вы можете рассылать:</p> <ul> <li>1000 уникальных посетителей = 500 писем в месяц</li> <li>10 000 уникальных посетителей = 2500 писем в месяц</li> <li>30 000 уникальных посетителей = 10 000 писем в месяц</li> <li>60 000 уникальных посетителей = 15 000 писем в месяц</li> <li>100 000 уникальных посетителей = 20 000 писем в месяц</li> <li>150 000 уникальных посетителей = 30 000 писем в месяц</li> <li>200 000 уникальных посетителей = 40 000 писем в месяц</li> <li>300 000 уникальных посетителей = 50 000 писем в месяц</li> </ul> <p> Если вы превысите квоту, то за каждую следующую 1000 писем вы заплатите 50 рублей. </p>'
				},
				{
					question: 'Что если у меня несколько сайтов?',
					answer: '<p> Вы можете подключить все свои сайты к одному аккаунту. К каждому сайту будет отдельный доступ и группа операторов/администраторов. Каждый сайт оплачивается отдельно. </p> <p> Если сайты находятся в рамках одного домена, рекомендуем на каждый из них разместить один и тот же код сервиса, тогда оплата будет как за один сайт. </p>'
				},
				{
					question: 'Что произойдёт, если я превышу квоты по тарифу?',
					answer: '<p> Работа сервиса не остановится. Мы пришлём вам счет на перерасход, который считается пропорционально вашему тарифу, или предложим перейти на новый тариф. </p> <p> Мы всегда отталкиваемся от более выгодного для вас варианта. </p>'
				},
				{
					question: 'Как можно оплатить сервис?',
					answer: '<ul> <li> По карте Visa, Mastecard<br> <span> Если вы оплатили сервис картой, подключается автоплатёж, и деньги автоматически спишутся в конце оплаченного периода. Так вы не пропустите случайно срок оплаты и не останетесь без инструментов. сервиса </span> </li> <li>Через электронный кошелёк</li> <li>Оплата через банк</li> <li>По безналичному расчету</li> </ul>'
				}
			]"
		/>

		<Consultation 
			title="Запишитесь на бесплатную демонстрацию сервиса" 
			text="Мы познакомимся, определим ваши задачи, за 30 минут обучим продукту и&nbsp;🎁&nbsp;бесплатно настроим базовый сценарий сбора лидов на вашем сайте"
			pic="medium-3.png"
			alt="Девочка, живущая в сети"
			bg="#fff3e6"
		/>

	</Layout>
</template>

<script>
	import Contacts 		from '~/components/Contacts.vue'
	import FAQ 				from '~/components/FAQ.vue'
	import Consultation 	from '~/components/Consultation.vue'

	export default {
		components: {
			Contacts,
			FAQ,
			Consultation
		},
		data() {
			return {
				//Делаем в HEAD
				metaTitle: 'Тарифы | Стоимость сервиса Carrot quest. 20% скидки при оплате за год',
				metaDescription: 'Полный комплект сервисов по автоматизации маркетинга и коммуникаций с пользователями от 800 ₽ в месяц',
				metaCanonical: 'https://www.carrotquest.io/price/',
				metaImage: 'https://www.carrotquest.io/assets/images/cover/price.png',
			}
		}
	}	
</script>


<style lang="scss">
	.page-price {
		.hero {
			background-color: #F3F3FF;
		}

		.extention {
			&__box {
				box-shadow: 0px 3px 10px rgba(0, 0, 0, 0.1);
				border-radius: 5px;
				padding: 20px 20px 110px;
				position: relative;
				height: 100%;
				font-size: 15px;
				.icon {
					float: left;
					margin-right: 1rem;
					margin-bottom: 1rem;
				}
				h4 {
					margin-top: -8px;
					font-weight: 400;
				}
				ul {
					clear: both;
				}
				p {
					margin-bottom: 0;
					clear: both;
				}
				.price {
					position: absolute;
					bottom: 1.5rem;
					overflow: hidden;
					font-family: 'PT Sans', sans-serif !important;
					a {
						margin: 0.5rem 0 0;
						display: inline-block;
					}
					.btn {
						color: #000;
						border: 1px solid #FF6600;
						border-radius: 5px;
						padding: 0.5rem 1.5rem 0.4rem;
						display: table;
						background: #fff;
						transition: all 150ms cubic-bezier(0, 0, 0.2, 1);
						&:hover {
							color: #fff;
							background: #FF6600;
						}
					}
				}
				.price_without_button {
					padding-bottom: 58px;
				}
				&.last {
					border: none;
					display: flex;
					align-items: center;
					justify-content: center;
					padding: 0;
					img {
						max-width: 100%;
					}
				}
			}
		}

		.all_features {
			ul {
				margin-bottom: 2rem;
				li {
					border-bottom: 1px solid #E8E8E8;
					padding-bottom: 0.5rem;
					&:last-child {
						border-bottom: 0;
					}
					&::before {
						content: "";
						width: 9px;
						height: 5px;
						border: 1px solid #333;
						background-color: transparent;
						border-top: none;
						border-right: none;
						transform: rotate(-45deg);
						margin-top: 0.5rem;
					}
				}
			}
		}

	}
</style>